name: "Sauron Tree V0.15"
layer {
  name: "data"
  type: "HDF5Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  hdf5_data_param {
    source: "train.txt"
    batch_size: 64
  }
}
layer {
  name: "data"
  type: "HDF5Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  hdf5_data_param {
    source: "test.txt"
    batch_size: 4
  }
}
layer {
  name: "slice_data"
  type: "Slice"
  bottom: "data"
  top: "data_r"
  top: "data_g"
  top: "data_b"
  slice_param {
    slice_dim: 1
    slice_point: 1
    slice_point: 2
  }
}
layer {
  name: "flat_data"
  type: "Flatten"
  bottom: "data_r"
  top: "flat_data"
}
layer {
  name: "flat_data_middle"
  type: "Flatten"
  bottom: "data_g"
  top: "flat_data_middle"
}
layer {
  name: "flat_data_p"
  type: "Flatten"
  bottom: "data_b"
  top: "flat_data_p"
}
layer {
  name: "slice_middle"
  type: "Slice"
  bottom: "flat_data_middle"
  top: "sim"
  top: "label_p"
  top: "else"
  slice_param {
    slice_dim: 1
    slice_point: 1
    slice_point: 2
  }
}
layer {
  name: "loss-else"
  type: "EuclideanLoss"
  bottom: "else"
  bottom: "else"
  top: "loss-else"
  loss_weight: 0
}
layer {
  name: "data-split1-slice"
  type: "Slice"
  bottom: "flat_data"
    top: "flat_data-0"
  top: "flat_data-1"
  top: "flat_data-2"
  top: "flat_data-3"
  top: "flat_data-4"
  top: "flat_data-5"
  top: "flat_data-6"
  top: "flat_data-7"
  top: "flat_data-8"
  top: "flat_data-9"
  top: "flat_data-10"
  top: "flat_data-11"
  top: "flat_data-12"
  top: "flat_data-13"
  top: "flat_data-14"
  top: "flat_data-15"
  top: "flat_data-16"
  top: "flat_data-17"
  top: "flat_data-18"
  top: "flat_data-19"
  top: "flat_data-20"
  top: "flat_data-21"
  top: "flat_data-22"
  top: "flat_data-23"
  top: "flat_data-24"
  top: "flat_data-25"
  top: "flat_data-26"
  top: "flat_data-27"
  top: "flat_data-28"
  top: "flat_data-29"
  top: "flat_data-30"
  top: "flat_data-31"
  top: "flat_data-32"
  top: "flat_data-33"
  top: "flat_data-34"
  top: "flat_data-35"
  top: "flat_data-36"
  top: "flat_data-37"
  top: "flat_data-38"
  top: "flat_data-39"
  top: "flat_data-40"
  top: "flat_data-41"
  top: "flat_data-42"
  top: "flat_data-43"
  top: "flat_data-44"
  top: "flat_data-45"
  top: "flat_data-46"
  top: "flat_data-47"
  top: "flat_data-48"
  top: "flat_data-49"
  top: "flat_data-50"
  top: "flat_data-51"
  top: "flat_data-52"
  top: "flat_data-53"
  top: "flat_data-54"
  top: "flat_data-55"
  top: "flat_data-56"
  top: "flat_data-57"
  top: "flat_data-58"
  top: "flat_data-59"
  top: "flat_data-60"
  top: "flat_data-61"
  top: "flat_data-62"
  top: "flat_data-63"
  top: "flat_data-64"
  top: "flat_data-65"
  top: "flat_data-66"
  top: "flat_data-67"
  top: "flat_data-68"
  top: "flat_data-69"
  top: "flat_data-70"
  top: "flat_data-71"
  top: "flat_data-72"
  top: "flat_data-73"
  top: "flat_data-74"
  top: "flat_data-75"
  top: "flat_data-76"
  top: "flat_data-77"
  top: "flat_data-78"
  top: "flat_data-79"
  top: "flat_data-80"
  top: "flat_data-81"
  top: "flat_data-82"
  top: "flat_data-83"
  top: "flat_data-84"
  top: "flat_data-85"
  top: "flat_data-86"
  top: "flat_data-87"
  top: "flat_data-88"
  top: "flat_data-89"
  top: "flat_data-90"
  top: "flat_data-91"
  top: "flat_data-92"
  top: "flat_data-93"
  top: "flat_data-94"
  top: "flat_data-95"
  top: "flat_data-96"
  top: "flat_data-97"
  top: "flat_data-98"
  top: "flat_data-99"
  top: "flat_data-100"
  top: "flat_data-101"
  top: "flat_data-102"
  top: "flat_data-103"
  top: "flat_data-104"
  top: "flat_data-105"
  top: "flat_data-106"
  top: "flat_data-107"
  top: "flat_data-108"
  top: "flat_data-109"
  top: "flat_data-110"
  top: "flat_data-111"
  top: "flat_data-112"
  top: "flat_data-113"
  top: "flat_data-114"
  top: "flat_data-115"
  top: "flat_data-116"
  top: "flat_data-117"
  top: "flat_data-118"
  top: "flat_data-119"
  top: "flat_data-120"
  top: "flat_data-121"
  top: "flat_data-122"
  top: "flat_data-123"
  top: "flat_data-124"
  top: "flat_data-125"
  top: "flat_data-126"
  top: "flat_data-127"
  top: "flat_data-128"
  top: "flat_data-129"
  top: "flat_data-130"
  top: "flat_data-131"
  top: "flat_data-132"
  top: "flat_data-133"
  top: "flat_data-134"
  top: "flat_data-135"
  top: "flat_data-136"
  top: "flat_data-137"
  top: "flat_data-138"
  top: "flat_data-139"
  top: "flat_data-140"
  top: "flat_data-141"
  top: "flat_data-142"
  top: "flat_data-143"
  top: "flat_data-144"
  top: "flat_data-145"
  top: "flat_data-146"
  top: "flat_data-147"
  top: "flat_data-148"
  top: "flat_data-149"
  top: "flat_data-150"
  top: "flat_data-151"
  top: "flat_data-152"
  top: "flat_data-153"
  top: "flat_data-154"
  top: "flat_data-155"
  top: "flat_data-156"
  top: "flat_data-157"
  top: "flat_data-158"
  top: "flat_data-159"
  top: "flat_data-160"
  top: "flat_data-161"
  top: "flat_data-162"
  top: "flat_data-163"
  top: "flat_data-164"
  top: "flat_data-165"
  top: "flat_data-166"
  top: "flat_data-167"
  top: "flat_data-168"
  top: "flat_data-169"
  top: "flat_data-170"
  top: "flat_data-171"
  top: "flat_data-172"
  top: "flat_data-173"
  top: "flat_data-174"
  top: "flat_data-175"
  top: "flat_data-176"
  top: "flat_data-177"
  top: "flat_data-178"
  top: "flat_data-179"
  top: "flat_data-180"
  top: "flat_data-181"
  top: "flat_data-182"
  top: "flat_data-183"
  top: "flat_data-184"
  top: "flat_data-185"
  top: "flat_data-186"
  top: "flat_data-187"
  top: "flat_data-188"
  top: "flat_data-189"
  top: "flat_data-190"
  top: "flat_data-191"
  top: "flat_data-192"
  top: "flat_data-193"
  top: "flat_data-194"
  top: "flat_data-195"
  top: "flat_data-196"
  top: "flat_data-197"
  top: "flat_data-198"
  top: "flat_data-199"
  top: "flat_data-200"
  top: "flat_data-201"
  top: "flat_data-202"
  top: "flat_data-203"
  top: "flat_data-204"
  top: "flat_data-205"
  top: "flat_data-206"
  top: "flat_data-207"
  top: "flat_data-208"
  top: "flat_data-209"
  top: "flat_data-210"
  top: "flat_data-211"
  top: "flat_data-212"
  top: "flat_data-213"
  top: "flat_data-214"
  top: "flat_data-215"
  top: "flat_data-216"
  top: "flat_data-217"
  top: "flat_data-218"
  top: "flat_data-219"
  top: "flat_data-220"
  top: "flat_data-221"
  top: "flat_data-222"
  top: "flat_data-223"
  top: "flat_data-224"
  top: "flat_data-225"
  top: "flat_data-226"

  slice_param {
    slice_dim: 1
        slice_point: 227
    slice_point: 454
    slice_point: 681
    slice_point: 908
    slice_point: 1135
    slice_point: 1362
    slice_point: 1589
    slice_point: 1816
    slice_point: 2043
    slice_point: 2270
    slice_point: 2497
    slice_point: 2724
    slice_point: 2951
    slice_point: 3178
    slice_point: 3405
    slice_point: 3632
    slice_point: 3859
    slice_point: 4086
    slice_point: 4313
    slice_point: 4540
    slice_point: 4767
    slice_point: 4994
    slice_point: 5221
    slice_point: 5448
    slice_point: 5675
    slice_point: 5902
    slice_point: 6129
    slice_point: 6356
    slice_point: 6583
    slice_point: 6810
    slice_point: 7037
    slice_point: 7264
    slice_point: 7491
    slice_point: 7718
    slice_point: 7945
    slice_point: 8172
    slice_point: 8399
    slice_point: 8626
    slice_point: 8853
    slice_point: 9080
    slice_point: 9307
    slice_point: 9534
    slice_point: 9761
    slice_point: 9988
    slice_point: 10215
    slice_point: 10442
    slice_point: 10669
    slice_point: 10896
    slice_point: 11123
    slice_point: 11350
    slice_point: 11577
    slice_point: 11804
    slice_point: 12031
    slice_point: 12258
    slice_point: 12485
    slice_point: 12712
    slice_point: 12939
    slice_point: 13166
    slice_point: 13393
    slice_point: 13620
    slice_point: 13847
    slice_point: 14074
    slice_point: 14301
    slice_point: 14528
    slice_point: 14755
    slice_point: 14982
    slice_point: 15209
    slice_point: 15436
    slice_point: 15663
    slice_point: 15890
    slice_point: 16117
    slice_point: 16344
    slice_point: 16571
    slice_point: 16798
    slice_point: 17025
    slice_point: 17252
    slice_point: 17479
    slice_point: 17706
    slice_point: 17933
    slice_point: 18160
    slice_point: 18387
    slice_point: 18614
    slice_point: 18841
    slice_point: 19068
    slice_point: 19295
    slice_point: 19522
    slice_point: 19749
    slice_point: 19976
    slice_point: 20203
    slice_point: 20430
    slice_point: 20657
    slice_point: 20884
    slice_point: 21111
    slice_point: 21338
    slice_point: 21565
    slice_point: 21792
    slice_point: 22019
    slice_point: 22246
    slice_point: 22473
    slice_point: 22700
    slice_point: 22927
    slice_point: 23154
    slice_point: 23381
    slice_point: 23608
    slice_point: 23835
    slice_point: 24062
    slice_point: 24289
    slice_point: 24516
    slice_point: 24743
    slice_point: 24970
    slice_point: 25197
    slice_point: 25424
    slice_point: 25651
    slice_point: 25878
    slice_point: 26105
    slice_point: 26332
    slice_point: 26559
    slice_point: 26786
    slice_point: 27013
    slice_point: 27240
    slice_point: 27467
    slice_point: 27694
    slice_point: 27921
    slice_point: 28148
    slice_point: 28375
    slice_point: 28602
    slice_point: 28829
    slice_point: 29056
    slice_point: 29283
    slice_point: 29510
    slice_point: 29737
    slice_point: 29964
    slice_point: 30191
    slice_point: 30418
    slice_point: 30645
    slice_point: 30872
    slice_point: 31099
    slice_point: 31326
    slice_point: 31553
    slice_point: 31780
    slice_point: 32007
    slice_point: 32234
    slice_point: 32461
    slice_point: 32688
    slice_point: 32915
    slice_point: 33142
    slice_point: 33369
    slice_point: 33596
    slice_point: 33823
    slice_point: 34050
    slice_point: 34277
    slice_point: 34504
    slice_point: 34731
    slice_point: 34958
    slice_point: 35185
    slice_point: 35412
    slice_point: 35639
    slice_point: 35866
    slice_point: 36093
    slice_point: 36320
    slice_point: 36547
    slice_point: 36774
    slice_point: 37001
    slice_point: 37228
    slice_point: 37455
    slice_point: 37682
    slice_point: 37909
    slice_point: 38136
    slice_point: 38363
    slice_point: 38590
    slice_point: 38817
    slice_point: 39044
    slice_point: 39271
    slice_point: 39498
    slice_point: 39725
    slice_point: 39952
    slice_point: 40179
    slice_point: 40406
    slice_point: 40633
    slice_point: 40860
    slice_point: 41087
    slice_point: 41314
    slice_point: 41541
    slice_point: 41768
    slice_point: 41995
    slice_point: 42222
    slice_point: 42449
    slice_point: 42676
    slice_point: 42903
    slice_point: 43130
    slice_point: 43357
    slice_point: 43584
    slice_point: 43811
    slice_point: 44038
    slice_point: 44265
    slice_point: 44492
    slice_point: 44719
    slice_point: 44946
    slice_point: 45173
    slice_point: 45400
    slice_point: 45627
    slice_point: 45854
    slice_point: 46081
    slice_point: 46308
    slice_point: 46535
    slice_point: 46762
    slice_point: 46989
    slice_point: 47216
    slice_point: 47443
    slice_point: 47670
    slice_point: 47897
    slice_point: 48124
    slice_point: 48351
    slice_point: 48578
    slice_point: 48805
    slice_point: 49032
    slice_point: 49259
    slice_point: 49486
    slice_point: 49713
    slice_point: 49940
    slice_point: 50167
    slice_point: 50394
    slice_point: 50621
    slice_point: 50848
    slice_point: 51075
    slice_point: 51302

  }
}
layer {
  name: "data-split1-slice_p"
  type: "Slice"
  bottom: "flat_data_p"
    top: "flat_data_p-0"
  top: "flat_data_p-1"
  top: "flat_data_p-2"
  top: "flat_data_p-3"
  top: "flat_data_p-4"
  top: "flat_data_p-5"
  top: "flat_data_p-6"
  top: "flat_data_p-7"
  top: "flat_data_p-8"
  top: "flat_data_p-9"
  top: "flat_data_p-10"
  top: "flat_data_p-11"
  top: "flat_data_p-12"
  top: "flat_data_p-13"
  top: "flat_data_p-14"
  top: "flat_data_p-15"
  top: "flat_data_p-16"
  top: "flat_data_p-17"
  top: "flat_data_p-18"
  top: "flat_data_p-19"
  top: "flat_data_p-20"
  top: "flat_data_p-21"
  top: "flat_data_p-22"
  top: "flat_data_p-23"
  top: "flat_data_p-24"
  top: "flat_data_p-25"
  top: "flat_data_p-26"
  top: "flat_data_p-27"
  top: "flat_data_p-28"
  top: "flat_data_p-29"
  top: "flat_data_p-30"
  top: "flat_data_p-31"
  top: "flat_data_p-32"
  top: "flat_data_p-33"
  top: "flat_data_p-34"
  top: "flat_data_p-35"
  top: "flat_data_p-36"
  top: "flat_data_p-37"
  top: "flat_data_p-38"
  top: "flat_data_p-39"
  top: "flat_data_p-40"
  top: "flat_data_p-41"
  top: "flat_data_p-42"
  top: "flat_data_p-43"
  top: "flat_data_p-44"
  top: "flat_data_p-45"
  top: "flat_data_p-46"
  top: "flat_data_p-47"
  top: "flat_data_p-48"
  top: "flat_data_p-49"
  top: "flat_data_p-50"
  top: "flat_data_p-51"
  top: "flat_data_p-52"
  top: "flat_data_p-53"
  top: "flat_data_p-54"
  top: "flat_data_p-55"
  top: "flat_data_p-56"
  top: "flat_data_p-57"
  top: "flat_data_p-58"
  top: "flat_data_p-59"
  top: "flat_data_p-60"
  top: "flat_data_p-61"
  top: "flat_data_p-62"
  top: "flat_data_p-63"
  top: "flat_data_p-64"
  top: "flat_data_p-65"
  top: "flat_data_p-66"
  top: "flat_data_p-67"
  top: "flat_data_p-68"
  top: "flat_data_p-69"
  top: "flat_data_p-70"
  top: "flat_data_p-71"
  top: "flat_data_p-72"
  top: "flat_data_p-73"
  top: "flat_data_p-74"
  top: "flat_data_p-75"
  top: "flat_data_p-76"
  top: "flat_data_p-77"
  top: "flat_data_p-78"
  top: "flat_data_p-79"
  top: "flat_data_p-80"
  top: "flat_data_p-81"
  top: "flat_data_p-82"
  top: "flat_data_p-83"
  top: "flat_data_p-84"
  top: "flat_data_p-85"
  top: "flat_data_p-86"
  top: "flat_data_p-87"
  top: "flat_data_p-88"
  top: "flat_data_p-89"
  top: "flat_data_p-90"
  top: "flat_data_p-91"
  top: "flat_data_p-92"
  top: "flat_data_p-93"
  top: "flat_data_p-94"
  top: "flat_data_p-95"
  top: "flat_data_p-96"
  top: "flat_data_p-97"
  top: "flat_data_p-98"
  top: "flat_data_p-99"
  top: "flat_data_p-100"
  top: "flat_data_p-101"
  top: "flat_data_p-102"
  top: "flat_data_p-103"
  top: "flat_data_p-104"
  top: "flat_data_p-105"
  top: "flat_data_p-106"
  top: "flat_data_p-107"
  top: "flat_data_p-108"
  top: "flat_data_p-109"
  top: "flat_data_p-110"
  top: "flat_data_p-111"
  top: "flat_data_p-112"
  top: "flat_data_p-113"
  top: "flat_data_p-114"
  top: "flat_data_p-115"
  top: "flat_data_p-116"
  top: "flat_data_p-117"
  top: "flat_data_p-118"
  top: "flat_data_p-119"
  top: "flat_data_p-120"
  top: "flat_data_p-121"
  top: "flat_data_p-122"
  top: "flat_data_p-123"
  top: "flat_data_p-124"
  top: "flat_data_p-125"
  top: "flat_data_p-126"
  top: "flat_data_p-127"
  top: "flat_data_p-128"
  top: "flat_data_p-129"
  top: "flat_data_p-130"
  top: "flat_data_p-131"
  top: "flat_data_p-132"
  top: "flat_data_p-133"
  top: "flat_data_p-134"
  top: "flat_data_p-135"
  top: "flat_data_p-136"
  top: "flat_data_p-137"
  top: "flat_data_p-138"
  top: "flat_data_p-139"
  top: "flat_data_p-140"
  top: "flat_data_p-141"
  top: "flat_data_p-142"
  top: "flat_data_p-143"
  top: "flat_data_p-144"
  top: "flat_data_p-145"
  top: "flat_data_p-146"
  top: "flat_data_p-147"
  top: "flat_data_p-148"
  top: "flat_data_p-149"
  top: "flat_data_p-150"
  top: "flat_data_p-151"
  top: "flat_data_p-152"
  top: "flat_data_p-153"
  top: "flat_data_p-154"
  top: "flat_data_p-155"
  top: "flat_data_p-156"
  top: "flat_data_p-157"
  top: "flat_data_p-158"
  top: "flat_data_p-159"
  top: "flat_data_p-160"
  top: "flat_data_p-161"
  top: "flat_data_p-162"
  top: "flat_data_p-163"
  top: "flat_data_p-164"
  top: "flat_data_p-165"
  top: "flat_data_p-166"
  top: "flat_data_p-167"
  top: "flat_data_p-168"
  top: "flat_data_p-169"
  top: "flat_data_p-170"
  top: "flat_data_p-171"
  top: "flat_data_p-172"
  top: "flat_data_p-173"
  top: "flat_data_p-174"
  top: "flat_data_p-175"
  top: "flat_data_p-176"
  top: "flat_data_p-177"
  top: "flat_data_p-178"
  top: "flat_data_p-179"
  top: "flat_data_p-180"
  top: "flat_data_p-181"
  top: "flat_data_p-182"
  top: "flat_data_p-183"
  top: "flat_data_p-184"
  top: "flat_data_p-185"
  top: "flat_data_p-186"
  top: "flat_data_p-187"
  top: "flat_data_p-188"
  top: "flat_data_p-189"
  top: "flat_data_p-190"
  top: "flat_data_p-191"
  top: "flat_data_p-192"
  top: "flat_data_p-193"
  top: "flat_data_p-194"
  top: "flat_data_p-195"
  top: "flat_data_p-196"
  top: "flat_data_p-197"
  top: "flat_data_p-198"
  top: "flat_data_p-199"
  top: "flat_data_p-200"
  top: "flat_data_p-201"
  top: "flat_data_p-202"
  top: "flat_data_p-203"
  top: "flat_data_p-204"
  top: "flat_data_p-205"
  top: "flat_data_p-206"
  top: "flat_data_p-207"
  top: "flat_data_p-208"
  top: "flat_data_p-209"
  top: "flat_data_p-210"
  top: "flat_data_p-211"
  top: "flat_data_p-212"
  top: "flat_data_p-213"
  top: "flat_data_p-214"
  top: "flat_data_p-215"
  top: "flat_data_p-216"
  top: "flat_data_p-217"
  top: "flat_data_p-218"
  top: "flat_data_p-219"
  top: "flat_data_p-220"
  top: "flat_data_p-221"
  top: "flat_data_p-222"
  top: "flat_data_p-223"
  top: "flat_data_p-224"
  top: "flat_data_p-225"
  top: "flat_data_p-226"

  slice_param {
    slice_dim: 1
        slice_point: 227
    slice_point: 454
    slice_point: 681
    slice_point: 908
    slice_point: 1135
    slice_point: 1362
    slice_point: 1589
    slice_point: 1816
    slice_point: 2043
    slice_point: 2270
    slice_point: 2497
    slice_point: 2724
    slice_point: 2951
    slice_point: 3178
    slice_point: 3405
    slice_point: 3632
    slice_point: 3859
    slice_point: 4086
    slice_point: 4313
    slice_point: 4540
    slice_point: 4767
    slice_point: 4994
    slice_point: 5221
    slice_point: 5448
    slice_point: 5675
    slice_point: 5902
    slice_point: 6129
    slice_point: 6356
    slice_point: 6583
    slice_point: 6810
    slice_point: 7037
    slice_point: 7264
    slice_point: 7491
    slice_point: 7718
    slice_point: 7945
    slice_point: 8172
    slice_point: 8399
    slice_point: 8626
    slice_point: 8853
    slice_point: 9080
    slice_point: 9307
    slice_point: 9534
    slice_point: 9761
    slice_point: 9988
    slice_point: 10215
    slice_point: 10442
    slice_point: 10669
    slice_point: 10896
    slice_point: 11123
    slice_point: 11350
    slice_point: 11577
    slice_point: 11804
    slice_point: 12031
    slice_point: 12258
    slice_point: 12485
    slice_point: 12712
    slice_point: 12939
    slice_point: 13166
    slice_point: 13393
    slice_point: 13620
    slice_point: 13847
    slice_point: 14074
    slice_point: 14301
    slice_point: 14528
    slice_point: 14755
    slice_point: 14982
    slice_point: 15209
    slice_point: 15436
    slice_point: 15663
    slice_point: 15890
    slice_point: 16117
    slice_point: 16344
    slice_point: 16571
    slice_point: 16798
    slice_point: 17025
    slice_point: 17252
    slice_point: 17479
    slice_point: 17706
    slice_point: 17933
    slice_point: 18160
    slice_point: 18387
    slice_point: 18614
    slice_point: 18841
    slice_point: 19068
    slice_point: 19295
    slice_point: 19522
    slice_point: 19749
    slice_point: 19976
    slice_point: 20203
    slice_point: 20430
    slice_point: 20657
    slice_point: 20884
    slice_point: 21111
    slice_point: 21338
    slice_point: 21565
    slice_point: 21792
    slice_point: 22019
    slice_point: 22246
    slice_point: 22473
    slice_point: 22700
    slice_point: 22927
    slice_point: 23154
    slice_point: 23381
    slice_point: 23608
    slice_point: 23835
    slice_point: 24062
    slice_point: 24289
    slice_point: 24516
    slice_point: 24743
    slice_point: 24970
    slice_point: 25197
    slice_point: 25424
    slice_point: 25651
    slice_point: 25878
    slice_point: 26105
    slice_point: 26332
    slice_point: 26559
    slice_point: 26786
    slice_point: 27013
    slice_point: 27240
    slice_point: 27467
    slice_point: 27694
    slice_point: 27921
    slice_point: 28148
    slice_point: 28375
    slice_point: 28602
    slice_point: 28829
    slice_point: 29056
    slice_point: 29283
    slice_point: 29510
    slice_point: 29737
    slice_point: 29964
    slice_point: 30191
    slice_point: 30418
    slice_point: 30645
    slice_point: 30872
    slice_point: 31099
    slice_point: 31326
    slice_point: 31553
    slice_point: 31780
    slice_point: 32007
    slice_point: 32234
    slice_point: 32461
    slice_point: 32688
    slice_point: 32915
    slice_point: 33142
    slice_point: 33369
    slice_point: 33596
    slice_point: 33823
    slice_point: 34050
    slice_point: 34277
    slice_point: 34504
    slice_point: 34731
    slice_point: 34958
    slice_point: 35185
    slice_point: 35412
    slice_point: 35639
    slice_point: 35866
    slice_point: 36093
    slice_point: 36320
    slice_point: 36547
    slice_point: 36774
    slice_point: 37001
    slice_point: 37228
    slice_point: 37455
    slice_point: 37682
    slice_point: 37909
    slice_point: 38136
    slice_point: 38363
    slice_point: 38590
    slice_point: 38817
    slice_point: 39044
    slice_point: 39271
    slice_point: 39498
    slice_point: 39725
    slice_point: 39952
    slice_point: 40179
    slice_point: 40406
    slice_point: 40633
    slice_point: 40860
    slice_point: 41087
    slice_point: 41314
    slice_point: 41541
    slice_point: 41768
    slice_point: 41995
    slice_point: 42222
    slice_point: 42449
    slice_point: 42676
    slice_point: 42903
    slice_point: 43130
    slice_point: 43357
    slice_point: 43584
    slice_point: 43811
    slice_point: 44038
    slice_point: 44265
    slice_point: 44492
    slice_point: 44719
    slice_point: 44946
    slice_point: 45173
    slice_point: 45400
    slice_point: 45627
    slice_point: 45854
    slice_point: 46081
    slice_point: 46308
    slice_point: 46535
    slice_point: 46762
    slice_point: 46989
    slice_point: 47216
    slice_point: 47443
    slice_point: 47670
    slice_point: 47897
    slice_point: 48124
    slice_point: 48351
    slice_point: 48578
    slice_point: 48805
    slice_point: 49032
    slice_point: 49259
    slice_point: 49486
    slice_point: 49713
    slice_point: 49940
    slice_point: 50167
    slice_point: 50394
    slice_point: 50621
    slice_point: 50848
    slice_point: 51075
    slice_point: 51302

  }
}
layer {
  name: "data-split1-slice-ip_0-0"
  type: "InnerProduct"
  bottom: "flat_data-0"
  top: "data-split1-slice-ip_0-0"
  param {
    name: "data-split1-slice-ip_0-0_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_0-0_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_0-0"
  type: "ReLU"
  bottom: "data-split1-slice-ip_0-0"
  top: "data-split1-slice-ip_0-0"
}
layer {
  name: "data-split1-slice-ip_0-0_p"
  type: "InnerProduct"
  bottom: "flat_data_p-0"
  top: "data-split1-slice-ip_0-0_p"
  param {
    name: "data-split1-slice-ip_0-0_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_0-0_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_0-0_p"
  type: "ReLU"
  bottom: "data-split1-slice-ip_0-0_p"
  top: "data-split1-slice-ip_0-0_p"
}
layer {
  name: "data-split1-slice-ip_0-1"
  type: "InnerProduct"
  bottom: "data-split1-slice-ip_0-0"
  top: "data-split1-slice-ip_0-1"
  param {
    name: "data-split1-slice-ip_0-1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_0-1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 168
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_0-1"
  type: "ReLU"
  bottom: "data-split1-slice-ip_0-1"
  top: "data-split1-slice-ip_0-1"
}
layer {
  name: "data-split1-slice-ip_0-1_p"
  type: "InnerProduct"
  bottom: "data-split1-slice-ip_0-0_p"
  top: "data-split1-slice-ip_0-1_p"
  param {
    name: "data-split1-slice-ip_0-1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_0-1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 168
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_0-1_p"
  type: "ReLU"
  bottom: "data-split1-slice-ip_0-1_p"
  top: "data-split1-slice-ip_0-1_p"
}
layer {
  name: "data-split1-slice-ip_1-0"
  type: "InnerProduct"
  bottom: "flat_data-1"
  top: "data-split1-slice-ip_1-0"
  param {
    name: "data-split1-slice-ip_1-0_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_1-0_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_1-0"
  type: "ReLU"
  bottom: "data-split1-slice-ip_1-0"
  top: "data-split1-slice-ip_1-0"
}
layer {
  name: "data-split1-slice-ip_1-0_p"
  type: "InnerProduct"
  bottom: "flat_data_p-1"
  top: "data-split1-slice-ip_1-0_p"
  param {
    name: "data-split1-slice-ip_1-0_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_1-0_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_1-0_p"
  type: "ReLU"
  bottom: "data-split1-slice-ip_1-0_p"
  top: "data-split1-slice-ip_1-0_p"
}
layer {
  name: "data-split1-slice-ip_1-1"
  type: "InnerProduct"
  bottom: "data-split1-slice-ip_1-0"
  top: "data-split1-slice-ip_1-1"
  param {
    name: "data-split1-slice-ip_1-1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_1-1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 168
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_1-1"
  type: "ReLU"
  bottom: "data-split1-slice-ip_1-1"
  top: "data-split1-slice-ip_1-1"
}
layer {
  name: "data-split1-slice-ip_1-1_p"
  type: "InnerProduct"
  bottom: "data-split1-slice-ip_1-0_p"
  top: "data-split1-slice-ip_1-1_p"
  param {
    name: "data-split1-slice-ip_1-1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_1-1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 168
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_1-1_p"
  type: "ReLU"
  bottom: "data-split1-slice-ip_1-1_p"
  top: "data-split1-slice-ip_1-1_p"
}
layer {
  name: "data-split1-slice-ip_2-0"
  type: "InnerProduct"
  bottom: "flat_data-2"
  top: "data-split1-slice-ip_2-0"
  param {
    name: "data-split1-slice-ip_2-0_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_2-0_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_2-0"
  type: "ReLU"
  bottom: "data-split1-slice-ip_2-0"
  top: "data-split1-slice-ip_2-0"
}
layer {
  name: "data-split1-slice-ip_2-0_p"
  type: "InnerProduct"
  bottom: "flat_data_p-2"
  top: "data-split1-slice-ip_2-0_p"
  param {
    name: "data-split1-slice-ip_2-0_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_2-0_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_2-0_p"
  type: "ReLU"
  bottom: "data-split1-slice-ip_2-0_p"
  top: "data-split1-slice-ip_2-0_p"
}
layer {
  name: "data-split1-slice-ip_2-1"
  type: "InnerProduct"
  bottom: "data-split1-slice-ip_2-0"
  top: "data-split1-slice-ip_2-1"
  param {
    name: "data-split1-slice-ip_2-1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_2-1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 168
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_2-1"
  type: "ReLU"
  bottom: "data-split1-slice-ip_2-1"
  top: "data-split1-slice-ip_2-1"
}
layer {
  name: "data-split1-slice-ip_2-1_p"
  type: "InnerProduct"
  bottom: "data-split1-slice-ip_2-0_p"
  top: "data-split1-slice-ip_2-1_p"
  param {
    name: "data-split1-slice-ip_2-1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_2-1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 168
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_2-1_p"
  type: "ReLU"
  bottom: "data-split1-slice-ip_2-1_p"
  top: "data-split1-slice-ip_2-1_p"
}
layer {
  name: "data-split1-slice-ip_3-0"
  type: "InnerProduct"
  bottom: "flat_data-3"
  top: "data-split1-slice-ip_3-0"
  param {
    name: "data-split1-slice-ip_3-0_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_3-0_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_3-0"
  type: "ReLU"
  bottom: "data-split1-slice-ip_3-0"
  top: "data-split1-slice-ip_3-0"
}
layer {
  name: "data-split1-slice-ip_3-0_p"
  type: "InnerProduct"
  bottom: "flat_data_p-3"
  top: "data-split1-slice-ip_3-0_p"
  param {
    name: "data-split1-slice-ip_3-0_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_3-0_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_3-0_p"
  type: "ReLU"
  bottom: "data-split1-slice-ip_3-0_p"
  top: "data-split1-slice-ip_3-0_p"
}
layer {
  name: "data-split1-slice-ip_3-1"
  type: "InnerProduct"
  bottom: "data-split1-slice-ip_3-0"
  top: "data-split1-slice-ip_3-1"
  param {
    name: "data-split1-slice-ip_3-1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_3-1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 168
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_3-1"
  type: "ReLU"
  bottom: "data-split1-slice-ip_3-1"
  top: "data-split1-slice-ip_3-1"
}
layer {
  name: "data-split1-slice-ip_3-1_p"
  type: "InnerProduct"
  bottom: "data-split1-slice-ip_3-0_p"
  top: "data-split1-slice-ip_3-1_p"
  param {
    name: "data-split1-slice-ip_3-1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_3-1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 168
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_3-1_p"
  type: "ReLU"
  bottom: "data-split1-slice-ip_3-1_p"
  top: "data-split1-slice-ip_3-1_p"
}
layer {
  name: "data-split1-slice-ip_4-0"
  type: "InnerProduct"
  bottom: "flat_data-4"
  top: "data-split1-slice-ip_4-0"
  param {
    name: "data-split1-slice-ip_4-0_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_4-0_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_4-0"
  type: "ReLU"
  bottom: "data-split1-slice-ip_4-0"
  top: "data-split1-slice-ip_4-0"
}
layer {
  name: "data-split1-slice-ip_4-0_p"
  type: "InnerProduct"
  bottom: "flat_data_p-4"
  top: "data-split1-slice-ip_4-0_p"
  param {
    name: "data-split1-slice-ip_4-0_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_4-0_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_4-0_p"
  type: "ReLU"
  bottom: "data-split1-slice-ip_4-0_p"
  top: "data-split1-slice-ip_4-0_p"
}
layer {
  name: "data-split1-slice-ip_4-1"
  type: "InnerProduct"
  bottom: "data-split1-slice-ip_4-0"
  top: "data-split1-slice-ip_4-1"
  param {
    name: "data-split1-slice-ip_4-1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_4-1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 168
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_4-1"
  type: "ReLU"
  bottom: "data-split1-slice-ip_4-1"
  top: "data-split1-slice-ip_4-1"
}
layer {
  name: "data-split1-slice-ip_4-1_p"
  type: "InnerProduct"
  bottom: "data-split1-slice-ip_4-0_p"
  top: "data-split1-slice-ip_4-1_p"
  param {
    name: "data-split1-slice-ip_4-1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_4-1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 168
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_4-1_p"
  type: "ReLU"
  bottom: "data-split1-slice-ip_4-1_p"
  top: "data-split1-slice-ip_4-1_p"
}
layer {
  name: "data-split1-slice-ip_5-0"
  type: "InnerProduct"
  bottom: "flat_data-5"
  top: "data-split1-slice-ip_5-0"
  param {
    name: "data-split1-slice-ip_5-0_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_5-0_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_5-0"
  type: "ReLU"
  bottom: "data-split1-slice-ip_5-0"
  top: "data-split1-slice-ip_5-0"
}
layer {
  name: "data-split1-slice-ip_5-0_p"
  type: "InnerProduct"
  bottom: "flat_data_p-5"
  top: "data-split1-slice-ip_5-0_p"
  param {
    name: "data-split1-slice-ip_5-0_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_5-0_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_5-0_p"
  type: "ReLU"
  bottom: "data-split1-slice-ip_5-0_p"
  top: "data-split1-slice-ip_5-0_p"
}
layer {
  name: "data-split1-slice-ip_5-1"
  type: "InnerProduct"
  bottom: "data-split1-slice-ip_5-0"
  top: "data-split1-slice-ip_5-1"
  param {
    name: "data-split1-slice-ip_5-1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_5-1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 168
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_5-1"
  type: "ReLU"
  bottom: "data-split1-slice-ip_5-1"
  top: "data-split1-slice-ip_5-1"
}
layer {
  name: "data-split1-slice-ip_5-1_p"
  type: "InnerProduct"
  bottom: "data-split1-slice-ip_5-0_p"
  top: "data-split1-slice-ip_5-1_p"
  param {
    name: "data-split1-slice-ip_5-1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_5-1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 168
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_5-1_p"
  type: "ReLU"
  bottom: "data-split1-slice-ip_5-1_p"
  top: "data-split1-slice-ip_5-1_p"
}
layer {
  name: "data-split1-slice-ip_6-0"
  type: "InnerProduct"
  bottom: "flat_data-6"
  top: "data-split1-slice-ip_6-0"
  param {
    name: "data-split1-slice-ip_6-0_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_6-0_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_6-0"
  type: "ReLU"
  bottom: "data-split1-slice-ip_6-0"
  top: "data-split1-slice-ip_6-0"
}
layer {
  name: "data-split1-slice-ip_6-0_p"
  type: "InnerProduct"
  bottom: "flat_data_p-6"
  top: "data-split1-slice-ip_6-0_p"
  param {
    name: "data-split1-slice-ip_6-0_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_6-0_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_6-0_p"
  type: "ReLU"
  bottom: "data-split1-slice-ip_6-0_p"
  top: "data-split1-slice-ip_6-0_p"
}
layer {
  name: "data-split1-slice-ip_6-1"
  type: "InnerProduct"
  bottom: "data-split1-slice-ip_6-0"
  top: "data-split1-slice-ip_6-1"
  param {
    name: "data-split1-slice-ip_6-1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_6-1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 168
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_6-1"
  type: "ReLU"
  bottom: "data-split1-slice-ip_6-1"
  top: "data-split1-slice-ip_6-1"
}
layer {
  name: "data-split1-slice-ip_6-1_p"
  type: "InnerProduct"
  bottom: "data-split1-slice-ip_6-0_p"
  top: "data-split1-slice-ip_6-1_p"
  param {
    name: "data-split1-slice-ip_6-1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_6-1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 168
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_6-1_p"
  type: "ReLU"
  bottom: "data-split1-slice-ip_6-1_p"
  top: "data-split1-slice-ip_6-1_p"
}
layer {
  name: "data-split1-slice-ip_7-0"
  type: "InnerProduct"
  bottom: "flat_data-7"
  top: "data-split1-slice-ip_7-0"
  param {
    name: "data-split1-slice-ip_7-0_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_7-0_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_7-0"
  type: "ReLU"
  bottom: "data-split1-slice-ip_7-0"
  top: "data-split1-slice-ip_7-0"
}
layer {
  name: "data-split1-slice-ip_7-0_p"
  type: "InnerProduct"
  bottom: "flat_data_p-7"
  top: "data-split1-slice-ip_7-0_p"
  param {
    name: "data-split1-slice-ip_7-0_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_7-0_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_7-0_p"
  type: "ReLU"
  bottom: "data-split1-slice-ip_7-0_p"
  top: "data-split1-slice-ip_7-0_p"
}
layer {
  name: "data-split1-slice-ip_7-1"
  type: "InnerProduct"
  bottom: "data-split1-slice-ip_7-0"
  top: "data-split1-slice-ip_7-1"
  param {
    name: "data-split1-slice-ip_7-1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_7-1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 168
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_7-1"
  type: "ReLU"
  bottom: "data-split1-slice-ip_7-1"
  top: "data-split1-slice-ip_7-1"
}
layer {
  name: "data-split1-slice-ip_7-1_p"
  type: "InnerProduct"
  bottom: "data-split1-slice-ip_7-0_p"
  top: "data-split1-slice-ip_7-1_p"
  param {
    name: "data-split1-slice-ip_7-1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_7-1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 168
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_7-1_p"
  type: "ReLU"
  bottom: "data-split1-slice-ip_7-1_p"
  top: "data-split1-slice-ip_7-1_p"
}
layer {
  name: "data-split1-slice-ip_8-0"
  type: "InnerProduct"
  bottom: "flat_data-8"
  top: "data-split1-slice-ip_8-0"
  param {
    name: "data-split1-slice-ip_8-0_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_8-0_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_8-0"
  type: "ReLU"
  bottom: "data-split1-slice-ip_8-0"
  top: "data-split1-slice-ip_8-0"
}
layer {
  name: "data-split1-slice-ip_8-0_p"
  type: "InnerProduct"
  bottom: "flat_data_p-8"
  top: "data-split1-slice-ip_8-0_p"
  param {
    name: "data-split1-slice-ip_8-0_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_8-0_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_8-0_p"
  type: "ReLU"
  bottom: "data-split1-slice-ip_8-0_p"
  top: "data-split1-slice-ip_8-0_p"
}
layer {
  name: "data-split1-slice-ip_8-1"
  type: "InnerProduct"
  bottom: "data-split1-slice-ip_8-0"
  top: "data-split1-slice-ip_8-1"
  param {
    name: "data-split1-slice-ip_8-1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_8-1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 168
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_8-1"
  type: "ReLU"
  bottom: "data-split1-slice-ip_8-1"
  top: "data-split1-slice-ip_8-1"
}
layer {
  name: "data-split1-slice-ip_8-1_p"
  type: "InnerProduct"
  bottom: "data-split1-slice-ip_8-0_p"
  top: "data-split1-slice-ip_8-1_p"
  param {
    name: "data-split1-slice-ip_8-1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_8-1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 168
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_8-1_p"
  type: "ReLU"
  bottom: "data-split1-slice-ip_8-1_p"
  top: "data-split1-slice-ip_8-1_p"
}
layer {
  name: "data-split1-slice-ip_9-0"
  type: "InnerProduct"
  bottom: "flat_data-9"
  top: "data-split1-slice-ip_9-0"
  param {
    name: "data-split1-slice-ip_9-0_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_9-0_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_9-0"
  type: "ReLU"
  bottom: "data-split1-slice-ip_9-0"
  top: "data-split1-slice-ip_9-0"
}
layer {
  name: "data-split1-slice-ip_9-0_p"
  type: "InnerProduct"
  bottom: "flat_data_p-9"
  top: "data-split1-slice-ip_9-0_p"
  param {
    name: "data-split1-slice-ip_9-0_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_9-0_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_9-0_p"
  type: "ReLU"
  bottom: "data-split1-slice-ip_9-0_p"
  top: "data-split1-slice-ip_9-0_p"
}
layer {
  name: "data-split1-slice-ip_9-1"
  type: "InnerProduct"
  bottom: "data-split1-slice-ip_9-0"
  top: "data-split1-slice-ip_9-1"
  param {
    name: "data-split1-slice-ip_9-1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_9-1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 168
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_9-1"
  type: "ReLU"
  bottom: "data-split1-slice-ip_9-1"
  top: "data-split1-slice-ip_9-1"
}
layer {
  name: "data-split1-slice-ip_9-1_p"
  type: "InnerProduct"
  bottom: "data-split1-slice-ip_9-0_p"
  top: "data-split1-slice-ip_9-1_p"
  param {
    name: "data-split1-slice-ip_9-1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_9-1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 168
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_9-1_p"
  type: "ReLU"
  bottom: "data-split1-slice-ip_9-1_p"
  top: "data-split1-slice-ip_9-1_p"
}
layer {
  name: "data-split1-slice-ip_10-0"
  type: "InnerProduct"
  bottom: "flat_data-10"
  top: "data-split1-slice-ip_10-0"
  param {
    name: "data-split1-slice-ip_10-0_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_10-0_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_10-0"
  type: "ReLU"
  bottom: "data-split1-slice-ip_10-0"
  top: "data-split1-slice-ip_10-0"
}
layer {
  name: "data-split1-slice-ip_10-0_p"
  type: "InnerProduct"
  bottom: "flat_data_p-10"
  top: "data-split1-slice-ip_10-0_p"
  param {
    name: "data-split1-slice-ip_10-0_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "data-split1-slice-ip_10-0_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 200
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu-data-split1-slice-ip_10-0_p"
  type: "ReLU"
  bottom: "data-split1-slice-ip_10-0_p"
  top: "data-split1-slice-ip_10-0_p"
}
layer {
  name: "data-split1-slice-ip_10-1"
  type: "InnerProduct"
  bottom: "data-split1-slice-ip_10-0"
  top: "data-split1-slice-ip_10-1"
  param {
    name: "data-split1-slice-ip_10-1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
