#!/usr/bin/python
# -*- coding: utf-8 -*-

# Copyright: 2015 Jingyi Xiao
# FileName: starName.py
# Date: 2015 2015年05月23日 星期六 15时38分52秒
# Encoding: utf-8
# Author: Jingyi Xiao <kxwarning@126.com>
# Note: This source file is NOT a freeware

__author__="Jingyi"

import os, sys, time
sys.path.append("/datas/lib/py")

os.environ['NLS_LANG'] = 'SIMPLIFIED CHINESE_CHINA.UTF8'

class StarName(object):
    def __init__(self, conf):
        self.conf = {}
        self.conf = conf
    
    def getNamesFemale(self):
        ls = [
            '范冰冰', 'Angelababy', '杨幂', '唐嫣', '张馨予', '张柏芝', '柳岩', '刘亦菲', '林志玲', '郑爽',
            '张靓颖', '高圆圆', '刘诗诗', '李冰冰', '刘涛', '赵丽颖', '汤唯', '孙俪', '宋智孝', '赵薇', '舒淇',
            '赵奕欢', '李小璐', '景甜', '佟丽娅', '林心如', '章子怡', '陈乔恩', '徐若瑄', '蔡依林',
            '王菲', '蔡卓妍', '朴信惠', '林允儿', '水原希子', '全智贤', '金泫雅', '宋慧乔', '郑秀妍', '尹恩惠',
            '艾薇儿', '梅根·福克斯', '米兰达·可儿', '艾玛·沃特森', '伊娃·格林', '奥黛丽·赫本', '泰勒·斯威夫特',
            '阿曼达·塞弗里德', '达科塔·范宁', '卡拉·迪瓦伊', '杨紫', '戚薇', '古力娜扎', '黄圣依', '霍思燕',
            '谢娜', '王丽坤', '刘雨欣', '李宇春', '周韦彤', '王祖贤', '王珞丹', '姚笛', '宋茜', '马苏', '杨钰莹',
            '周迅', '安以轩', '何洁', '蓝燕', '林青霞', '钟欣桐', '赵雅芝', '郭采洁', '朱茵', '张俪', '张雨绮',
            '周秀娜', '徐静蕾', '阿兰', '金莎', '杉原杏璃', '周慧敏', '甘婷婷', '金泰妍', '桂纶镁', '张歆艺',
            '陈好', '董洁', '王心凌', '杨丞琳', '苗圃', '孙燕姿', '蔡妍', '林依晨', '莫文蔚', '伊能静', '萧蔷',
            '袁姗姗', '张韶涵', '弦子', '徐娇', '李玟', '李孝利', '萧亚轩', '梁静茹', '张含韵', '刘若英', '姚晨',
            '陈意涵', '薛凯琪', '金泰熙', '尚雯婕', '张嘉倪', 'Hebe', '刘羽琦', '佘诗曼', '翁美玲', '刘惜君',
            '徐熙媛', '郑秀文', '赵子琪', '权侑莉', '徐璐', '冯媛甄', '徐珠贤', '夏奇拉', '官恩娜', '玛丽莲·梦露',
        ]
        ls = [
            '张靓颖', 
        ]
        return ls

    def getNamesMale(self):
        ls = ['李易峰', '权志龙', '成龙', '鹿晗', '陈冠希', '吴亦凡', '黄晓明', '刘德华', '邓超', '钟汉良', '五月天',
            '张杰', '陈坤', '刘恺威', '周杰伦', '李敏镐', '张翰', '魏晨', 'bigbang', '张国荣', '谢霆锋', '彭于晏',
            '文章', '李小龙', 'Rain', '吴彦祖', '尼坤', '张根硕', '郑容和', '玄彬', '金希澈', '梅西', '莱昂纳多',
            '莲花小王子', '克里斯·埃文斯', '罗伯特·帕丁森', '布拉德·皮特', '约翰尼·德普', '迈克尔·杰克逊', '汤姆·克鲁斯',
            '范·迪塞尔', '林志颖', '罗志祥', '陈翔', '王力宏', '林俊杰', '吴奇隆', '古天乐', '柯震东', '胡歌', '张学友',
            '罗晋', '吴尊', '汪东城', '冯绍峰', '霍建华', '金在中', '韩庚', '崔始源', '吴秀波', '马天宇', '林峰', '炎亚纶',
            '贾乃亮', '佟大为', '邱泽', '金贤重', '宋承宪', '赵又廷', '李弘基', '苏有朋', '乔任梁', '朴有天', '付辛博',
            '李准基', 'CNBLUE', '杜淳', '古川雄辉', '宋仲基', '阿信', '林更新', '潘玮柏', '2PM', '言承旭', '明道',
            'SHINee', '周渝民', '金俊秀', '阮经天', '俞灏明', '萧敬腾', '郑允浩', '郑嘉颖', '唐禹哲', '贺军翔', '金俊绵',
            '赤西仁', '李东海', 'SuperJunior', '朴施厚', '沈昌珉', '辰亦儒', '李光洁', '文晸赫', '小罗伯特·唐尼', '马特·达蒙',
            '朴正洙',
        ]
        ls = []
        return ls

    def testPrint(self):
        print "Hello World!"

def main():
    conf = {}
    t = StarName(conf)
    t.testPrint()
    return

if __name__ == "__main__":
    main()

# Modeline for ViM {{{
# vim:set ts=4:
# vim600:fdm=marker fdl=0 fdc=3:
# }}}

