layer {
  name: "data"
  type: "Python"
  top: "data"
  top: "label"
  top: "zeros"
  top: "ones"
  top: "ones_"
  include {
    phase: TRAIN
  }
  python_param {
    module: "DataTrain"
    layer: "DataTrain"
  }
}
layer {
  name: "fc_1"
  type: "InnerProduct"
  bottom: "data"
  top: "fc_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_1"
  type: "ReLU"
  bottom: "fc_1"
  top: "fc_1"
}
layer {
  name: "fc_2"
  type: "InnerProduct"
  bottom: "fc_1"
  top: "fc_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "sigmoid_1"
  type: "Sigmoid"
  bottom: "fc_2"
  top: "sigmoid_1"
}
layer {
  name: "fc_3"
  type: "InnerProduct"
  bottom: "sigmoid_1"
  top: "fc_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "sigmoid_2"
  type: "Sigmoid"
  bottom: "fc_3"
  top: "sigmoid_2"
}
layer {
  name: "samedrop_1"
  type: "SameDropout"
  bottom: "sigmoid_2"
  bottom: "fc_1"
  top: "samedrop_1"
  dropout_param {
    is_scale: false
  }
}
layer {
  name: "loss_1"
  type: "EuclideanLoss"
  bottom: "samedrop_1"
  bottom: "zeros"
  top: "loss_1"
  loss_weight: 0.1
}
layer {
  name: "samedrop_2"
  type: "SameDropout"
  bottom: "fc_1"
  bottom: "sigmoid_2"
  top: "samedrop_2"
  dropout_param {
    is_scale: false
  }
}
layer {
  name: "bn_1"
  type: "BatchNorm"
  bottom: "samedrop_2"
  top: "bn_1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale_1"
  type: "Scale"
  bottom: "bn_1"
  top: "scale_1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "silence_1"
  type: "Silence"
  bottom: "zeros"
}
layer {
  name: "silence_2"
  type: "Silence"
  bottom: "ones"
}
layer {
  name: "silence_3"
  type: "Silence"
  bottom: "ones_"
}
layer {
  name: "fc_4"
  type: "InnerProduct"
  bottom: "scale_1"
  top: "fc_4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "sigmoid_3"
  type: "Sigmoid"
  bottom: "fc_4"
  top: "sigmoid_3"
}
layer {
  name: "out_1"
  type: "InnerProduct"
  bottom: "sigmoid_3"
  top: "out_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss_2"
  type: "SoftmaxWithLoss"
  bottom: "out_1"
  bottom: "label"
  top: "loss_2"
  loss_weight: 1
}
layer {
  name: "acc_1"
  type: "Accuracy"
  bottom: "out_1"
  bottom: "label"
  top: "acc_1"
}
