layer {
  name: "data"
  type: "Python"
  top: "data"
  top: "label_muti"
  top: "label"
  top: "label_"
  top: "sim"
  top: "zeros"
  top: "ones"
  include {
    phase: TEST
  }
  python_param {
    module: "DataTest"
    layer: "DataTest"
  }
}
layer {
  name: "slice_1"
  type: "Slice"
  bottom: "data"
  top: "slice_1"
  top: "slice_2"
  top: "slice_3"
  slice_param {
    slice_point: 8017
    slice_point: 16034
    axis: 3
  }
}
layer {
  name: "silence_1"
  type: "Silence"
  bottom: "label_"
}
layer {
  name: "slice_4"
  type: "Slice"
  bottom: "slice_1"
  top: "slice_4"
  top: "slice_5"
  slice_param {
    slice_point: 17
    axis: 3
  }
}
layer {
  name: "fc_1"
  type: "InnerProduct"
  bottom: "slice_4"
  top: "fc_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_1"
  type: "ReLU"
  bottom: "fc_1"
  top: "fc_1"
}
layer {
  name: "groupdrop_1"
  type: "GroupDropout"
  bottom: "slice_5"
  top: "groupdrop_1"
  group_dropout_param {
    group_use: 400
    group_total: 800
  }
}
layer {
  name: "conv_1"
  type: "Convolution"
  bottom: "groupdrop_1"
  top: "conv_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.00098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 10
    stride_h: 1
    stride_w: 10
  }
}
layer {
  name: "relu_2"
  type: "ReLU"
  bottom: "conv_1"
  top: "conv_1"
}
layer {
  name: "norm_1"
  type: "LRN"
  bottom: "conv_1"
  top: "norm_1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv_2"
  type: "Convolution"
  bottom: "norm_1"
  top: "conv_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.00098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    pad_h: 0
    pad_w: 2
    kernel_h: 1
    kernel_w: 6
    stride_h: 1
    stride_w: 2
  }
}
layer {
  name: "relu_3"
  type: "ReLU"
  bottom: "conv_2"
  top: "conv_2"
}
layer {
  name: "conv_3"
  type: "Convolution"
  bottom: "conv_2"
  top: "conv_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.00098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 4
    stride_h: 1
    stride_w: 2
  }
}
layer {
  name: "relu_4"
  type: "ReLU"
  bottom: "conv_3"
  top: "conv_3"
}
layer {
  name: "conv_4"
  type: "Convolution"
  bottom: "conv_3"
  top: "conv_4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.00098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 4
    stride_h: 1
    stride_w: 2
  }
}
layer {
  name: "relu_5"
  type: "ReLU"
  bottom: "conv_4"
  top: "conv_4"
}
layer {
  name: "flatten_1"
  type: "Flatten"
  bottom: "conv_4"
  top: "flatten_1"
}
layer {
  name: "concat_1"
  type: "Concat"
  bottom: "fc_1"
  bottom: "flatten_1"
  top: "concat_1"
}
layer {
  name: "fc_2"
  type: "InnerProduct"
  bottom: "concat_1"
  top: "fc_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "xavier"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_6"
  type: "ReLU"
  bottom: "fc_2"
  top: "fc_2"
}
layer {
  name: "samedrop_1"
  type: "SameDropout"
  bottom: "ones"
  bottom: "fc_2"
  top: "samedrop_1"
  dropout_param {
    is_scale: false
  }
}
layer {
  name: "fc_3"
  type: "InnerProduct"
  bottom: "samedrop_1"
  top: "fc_3"
  param {
    name: "w1"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b1"
    lr_mult: 2
    decay_mult: 2
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "sigmoid_1"
  type: "Sigmoid"
  bottom: "fc_3"
  top: "sigmoid_1"
}
layer {
  name: "fc_4"
  type: "InnerProduct"
  bottom: "sigmoid_1"
  top: "fc_4"
  param {
    name: "w2"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b2"
    lr_mult: 2
    decay_mult: 2
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "sigmoid_2"
  type: "Sigmoid"
  bottom: "fc_4"
  top: "sigmoid_2"
}
layer {
  name: "samedrop_2"
  type: "SameDropout"
  bottom: "sigmoid_2"
  bottom: "fc_2"
  top: "samedrop_2"
  dropout_param {
    is_scale: false
  }
}
layer {
  name: "loss_1"
  type: "EuclideanLoss"
  bottom: "samedrop_2"
  bottom: "zeros"
  top: "loss_1"
  loss_weight: 0.1
}
layer {
  name: "samedrop_3"
  type: "SameDropout"
  bottom: "fc_2"
  bottom: "sigmoid_2"
  top: "samedrop_3"
  dropout_param {
    is_scale: false
  }
}
layer {
  name: "bn_1"
  type: "BatchNorm"
  bottom: "samedrop_3"
  top: "bn_1"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale_1"
  type: "Scale"
  bottom: "bn_1"
  top: "scale_1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fc_5"
  type: "InnerProduct"
  bottom: "scale_1"
  top: "fc_5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "xavier"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_7"
  type: "ReLU"
  bottom: "fc_5"
  top: "fc_5"
}
layer {
  name: "samedrop_4"
  type: "SameDropout"
  bottom: "ones"
  bottom: "fc_5"
  top: "samedrop_4"
  dropout_param {
    is_scale: false
  }
}
layer {
  name: "fc_6"
  type: "InnerProduct"
  bottom: "samedrop_4"
  top: "fc_6"
  param {
    name: "w3"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b3"
    lr_mult: 2
    decay_mult: 2
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "sigmoid_3"
  type: "Sigmoid"
  bottom: "fc_6"
  top: "sigmoid_3"
}
layer {
  name: "fc_7"
  type: "InnerProduct"
  bottom: "sigmoid_3"
  top: "fc_7"
  param {
    name: "w4"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b4"
    lr_mult: 2
    decay_mult: 2
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "sigmoid_4"
  type: "Sigmoid"
  bottom: "fc_7"
  top: "sigmoid_4"
}
layer {
  name: "samedrop_5"
  type: "SameDropout"
  bottom: "sigmoid_4"
  bottom: "fc_5"
  top: "samedrop_5"
  dropout_param {
    is_scale: false
  }
}
layer {
  name: "loss_2"
  type: "EuclideanLoss"
  bottom: "samedrop_5"
  bottom: "zeros"
  top: "loss_2"
  loss_weight: 0.1
}
layer {
  name: "samedrop_6"
  type: "SameDropout"
  bottom: "fc_5"
  bottom: "sigmoid_4"
  top: "samedrop_6"
  dropout_param {
    is_scale: false
  }
}
layer {
  name: "bn_2"
  type: "BatchNorm"
  bottom: "samedrop_6"
  top: "bn_2"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale_2"
  type: "Scale"
  bottom: "bn_2"
  top: "scale_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "out_1"
  type: "InnerProduct"
  bottom: "scale_2"
  top: "out_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 20
    weight_filler {
      type: "xavier"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "sigmoid_5"
  type: "Sigmoid"
  bottom: "out_1"
  top: "sigmoid_5"
}
layer {
  name: "silence_2"
  type: "Silence"
  bottom: "sigmoid_5"
}
layer {
  name: "loss_3"
  type: "SigmoidCrossEntropyLoss"
  bottom: "out_1"
  bottom: "label_muti"
  top: "loss_3"
  loss_weight: 1.0
}
layer {
  name: "acc_1"
  type: "Accuracy"
  bottom: "out_1"
  bottom: "label"
  top: "acc_1"
}
layer {
  name: "slice_6"
  type: "Slice"
  bottom: "slice_2"
  top: "slice_6"
  top: "slice_7"
  slice_param {
    slice_point: 17
    axis: 3
  }
}
layer {
  name: "fc_8"
  type: "InnerProduct"
  bottom: "slice_6"
  top: "fc_8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_8"
  type: "ReLU"
  bottom: "fc_8"
  top: "fc_8"
}
layer {
  name: "groupdrop_2"
  type: "GroupDropout"
  bottom: "slice_7"
  top: "groupdrop_2"
  group_dropout_param {
    group_use: 400
    group_total: 800
  }
}
layer {
  name: "conv_5"
  type: "Convolution"
  bottom: "groupdrop_2"
  top: "conv_5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.00098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 10
    stride_h: 1
    stride_w: 10
  }
}
layer {
  name: "relu_9"
  type: "ReLU"
  bottom: "conv_5"
  top: "conv_5"
}
layer {
  name: "norm_2"
  type: "LRN"
  bottom: "conv_5"
  top: "norm_2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv_6"
  type: "Convolution"
  bottom: "norm_2"
  top: "conv_6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.00098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    pad_h: 0
    pad_w: 2
    kernel_h: 1
    kernel_w: 6
    stride_h: 1
    stride_w: 2
  }
}
layer {
  name: "relu_10"
  type: "ReLU"
  bottom: "conv_6"
  top: "conv_6"
}
layer {
  name: "conv_7"
  type: "Convolution"
  bottom: "conv_6"
  top: "conv_7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.00098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 4
    stride_h: 1
    stride_w: 2
  }
}
layer {
  name: "relu_11"
  type: "ReLU"
  bottom: "conv_7"
  top: "conv_7"
}
layer {
  name: "conv_8"
  type: "Convolution"
  bottom: "conv_7"
  top: "conv_8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.00098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 4
    stride_h: 1
    stride_w: 2
  }
}
layer {
  name: "relu_12"
  type: "ReLU"
  bottom: "conv_8"
  top: "conv_8"
}
layer {
  name: "flatten_2"
  type: "Flatten"
  bottom: "conv_8"
  top: "flatten_2"
}
layer {
  name: "concat_2"
  type: "Concat"
  bottom: "fc_8"
  bottom: "flatten_2"
  top: "concat_2"
}
layer {
  name: "fc_9"
  type: "InnerProduct"
  bottom: "concat_2"
  top: "fc_9"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "xavier"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_13"
  type: "ReLU"
  bottom: "fc_9"
  top: "fc_9"
}
layer {
  name: "samedrop_7"
  type: "SameDropout"
  bottom: "ones"
  bottom: "fc_9"
  top: "samedrop_7"
  dropout_param {
    is_scale: false
  }
}
layer {
  name: "fc_10"
  type: "InnerProduct"
  bottom: "samedrop_7"
  top: "fc_10"
  param {
    name: "w1"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b1"
    lr_mult: 2
    decay_mult: 2
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "sigmoid_6"
  type: "Sigmoid"
  bottom: "fc_10"
  top: "sigmoid_6"
}
layer {
  name: "fc_11"
  type: "InnerProduct"
  bottom: "sigmoid_6"
  top: "fc_11"
  param {
    name: "w2"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b2"
    lr_mult: 2
    decay_mult: 2
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "sigmoid_7"
  type: "Sigmoid"
  bottom: "fc_11"
  top: "sigmoid_7"
}
layer {
  name: "samedrop_8"
  type: "SameDropout"
  bottom: "sigmoid_7"
  bottom: "fc_9"
  top: "samedrop_8"
  dropout_param {
    is_scale: false
  }
}
layer {
  name: "loss_4"
  type: "EuclideanLoss"
  bottom: "samedrop_8"
  bottom: "zeros"
  top: "loss_4"
  loss_weight: 0.1
}
layer {
  name: "samedrop_9"
  type: "SameDropout"
  bottom: "fc_9"
  bottom: "sigmoid_7"
  top: "samedrop_9"
  dropout_param {
    is_scale: false
  }
}
layer {
  name: "bn_3"
  type: "BatchNorm"
  bottom: "samedrop_9"
  top: "bn_3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale_3"
  type: "Scale"
  bottom: "bn_3"
  top: "scale_3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fc_12"
  type: "InnerProduct"
  bottom: "scale_3"
  top: "fc_12"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "xavier"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_14"
  type: "ReLU"
  bottom: "fc_12"
  top: "fc_12"
}
layer {
  name: "samedrop_10"
  type: "SameDropout"
  bottom: "ones"
  bottom: "fc_12"
  top: "samedrop_10"
  dropout_param {
    is_scale: false
  }
}
layer {
  name: "fc_13"
  type: "InnerProduct"
  bottom: "samedrop_10"
  top: "fc_13"
  param {
    name: "w3"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b3"
    lr_mult: 2
    decay_mult: 2
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "sigmoid_8"
  type: "Sigmoid"
  bottom: "fc_13"
  top: "sigmoid_8"
}
layer {
  name: "fc_14"
  type: "InnerProduct"
  bottom: "sigmoid_8"
  top: "fc_14"
  param {
    name: "w4"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b4"
    lr_mult: 2
    decay_mult: 2
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "sigmoid_9"
  type: "Sigmoid"
  bottom: "fc_14"
  top: "sigmoid_9"
}
layer {
  name: "samedrop_11"
  type: "SameDropout"
  bottom: "sigmoid_9"
  bottom: "fc_12"
  top: "samedrop_11"
  dropout_param {
    is_scale: false
  }
}
layer {
  name: "loss_5"
  type: "EuclideanLoss"
  bottom: "samedrop_11"
  bottom: "zeros"
  top: "loss_5"
  loss_weight: 0.1
}
layer {
  name: "samedrop_12"
  type: "SameDropout"
  bottom: "fc_12"
  bottom: "sigmoid_9"
  top: "samedrop_12"
  dropout_param {
    is_scale: false
  }
}
layer {
  name: "bn_4"
  type: "BatchNorm"
  bottom: "samedrop_12"
  top: "bn_4"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale_4"
  type: "Scale"
  bottom: "bn_4"
  top: "scale_4"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "out_2"
  type: "InnerProduct"
  bottom: "scale_4"
  top: "out_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 20
    weight_filler {
      type: "xavier"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "sigmoid_10"
  type: "Sigmoid"
  bottom: "out_2"
  top: "sigmoid_10"
}
layer {
  name: "silence_3"
  type: "Silence"
  bottom: "sigmoid_10"
}
layer {
  name: "loss_6"
  type: "SigmoidCrossEntropyLoss"
  bottom: "out_2"
  bottom: "label_muti"
  top: "loss_6"
  loss_weight: 1.0
}
layer {
  name: "acc_2"
  type: "Accuracy"
  bottom: "out_2"
  bottom: "label"
  top: "acc_2"
}
layer {
  name: "slice_8"
  type: "Slice"
  bottom: "slice_3"
  top: "slice_8"
  top: "slice_9"
  slice_param {
    slice_point: 17
    axis: 3
  }
}
layer {
  name: "fc_15"
  type: "InnerProduct"
  bottom: "slice_8"
  top: "fc_15"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_15"
  type: "ReLU"
  bottom: "fc_15"
  top: "fc_15"
}
layer {
  name: "groupdrop_3"
  type: "GroupDropout"
  bottom: "slice_9"
  top: "groupdrop_3"
  group_dropout_param {
    group_use: 400
    group_total: 800
  }
}
layer {
  name: "conv_9"
  type: "Convolution"
  bottom: "groupdrop_3"
  top: "conv_9"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.00098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    pad_h: 0
    pad_w: 0
    kernel_h: 1
    kernel_w: 10
    stride_h: 1
    stride_w: 10
  }
}
layer {
  name: "relu_16"
  type: "ReLU"
  bottom: "conv_9"
  top: "conv_9"
}
layer {
  name: "norm_3"
  type: "LRN"
  bottom: "conv_9"
  top: "norm_3"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv_10"
  type: "Convolution"
  bottom: "norm_3"
  top: "conv_10"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.00098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    pad_h: 0
    pad_w: 2
    kernel_h: 1
    kernel_w: 6
    stride_h: 1
    stride_w: 2
  }
}
layer {
  name: "relu_17"
  type: "ReLU"
  bottom: "conv_10"
  top: "conv_10"
}
layer {
  name: "conv_11"
  type: "Convolution"
  bottom: "conv_10"
  top: "conv_11"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.00098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 4
    stride_h: 1
    stride_w: 2
  }
}
layer {
  name: "relu_18"
  type: "ReLU"
  bottom: "conv_11"
  top: "conv_11"
}
layer {
  name: "conv_12"
  type: "Convolution"
  bottom: "conv_11"
  top: "conv_12"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.00098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    pad_h: 0
    pad_w: 1
    kernel_h: 1
    kernel_w: 4
    stride_h: 1
    stride_w: 2
  }
}
layer {
  name: "relu_19"
  type: "ReLU"
  bottom: "conv_12"
  top: "conv_12"
}
layer {
  name: "flatten_3"
  type: "Flatten"
  bottom: "conv_12"
  top: "flatten_3"
}
layer {
  name: "concat_3"
  type: "Concat"
  bottom: "fc_15"
  bottom: "flatten_3"
  top: "concat_3"
}
layer {
  name: "fc_16"
  type: "InnerProduct"
  bottom: "concat_3"
  top: "fc_16"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "xavier"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_20"
  type: "ReLU"
  bottom: "fc_16"
  top: "fc_16"
}
layer {
  name: "samedrop_13"
  type: "SameDropout"
  bottom: "ones"
  bottom: "fc_16"
  top: "samedrop_13"
  dropout_param {
    is_scale: false
  }
}
layer {
  name: "fc_17"
  type: "InnerProduct"
  bottom: "samedrop_13"
  top: "fc_17"
  param {
    name: "w1"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b1"
    lr_mult: 2
    decay_mult: 2
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "sigmoid_11"
  type: "Sigmoid"
  bottom: "fc_17"
  top: "sigmoid_11"
}
layer {
  name: "fc_18"
  type: "InnerProduct"
  bottom: "sigmoid_11"
  top: "fc_18"
  param {
    name: "w2"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b2"
    lr_mult: 2
    decay_mult: 2
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "sigmoid_12"
  type: "Sigmoid"
  bottom: "fc_18"
  top: "sigmoid_12"
}
layer {
  name: "samedrop_14"
  type: "SameDropout"
  bottom: "sigmoid_12"
  bottom: "fc_16"
  top: "samedrop_14"
  dropout_param {
    is_scale: false
  }
}
layer {
  name: "loss_7"
  type: "EuclideanLoss"
  bottom: "samedrop_14"
  bottom: "zeros"
  top: "loss_7"
  loss_weight: 0.1
}
layer {
  name: "samedrop_15"
  type: "SameDropout"
  bottom: "fc_16"
  bottom: "sigmoid_12"
  top: "samedrop_15"
  dropout_param {
    is_scale: false
  }
}
layer {
  name: "bn_5"
  type: "BatchNorm"
  bottom: "samedrop_15"
  top: "bn_5"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale_5"
  type: "Scale"
  bottom: "bn_5"
  top: "scale_5"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "fc_19"
  type: "InnerProduct"
  bottom: "scale_5"
  top: "fc_19"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "xavier"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_21"
  type: "ReLU"
  bottom: "fc_19"
  top: "fc_19"
}
layer {
  name: "samedrop_16"
  type: "SameDropout"
  bottom: "ones"
  bottom: "fc_19"
  top: "samedrop_16"
  dropout_param {
    is_scale: false
  }
}
layer {
  name: "fc_20"
  type: "InnerProduct"
  bottom: "samedrop_16"
  top: "fc_20"
  param {
    name: "w3"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b3"
    lr_mult: 2
    decay_mult: 2
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "sigmoid_13"
  type: "Sigmoid"
  bottom: "fc_20"
  top: "sigmoid_13"
}
layer {
  name: "fc_21"
  type: "InnerProduct"
  bottom: "sigmoid_13"
  top: "fc_21"
  param {
    name: "w4"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "b4"
    lr_mult: 2
    decay_mult: 2
  }
  inner_product_param {
    num_output: 2048
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "sigmoid_14"
  type: "Sigmoid"
  bottom: "fc_21"
  top: "sigmoid_14"
}
layer {
  name: "samedrop_17"
  type: "SameDropout"
  bottom: "sigmoid_14"
  bottom: "fc_19"
  top: "samedrop_17"
  dropout_param {
    is_scale: false
  }
}
layer {
  name: "loss_8"
  type: "EuclideanLoss"
  bottom: "samedrop_17"
  bottom: "zeros"
  top: "loss_8"
  loss_weight: 0.1
}
layer {
  name: "samedrop_18"
  type: "SameDropout"
  bottom: "fc_19"
  bottom: "sigmoid_14"
  top: "samedrop_18"
  dropout_param {
    is_scale: false
  }
}
layer {
  name: "bn_6"
  type: "BatchNorm"
  bottom: "samedrop_18"
  top: "bn_6"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "scale_6"
  type: "Scale"
  bottom: "bn_6"
  top: "scale_6"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "out_3"
  type: "InnerProduct"
  bottom: "scale_6"
  top: "out_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 20
    weight_filler {
      type: "xavier"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "sigmoid_15"
  type: "Sigmoid"
  bottom: "out_3"
  top: "sigmoid_15"
}
layer {
  name: "silence_4"
  type: "Silence"
  bottom: "sigmoid_15"
}
layer {
  name: "loss_9"
  type: "SigmoidCrossEntropyLoss"
  bottom: "out_3"
  bottom: "label_muti"
  top: "loss_9"
  loss_weight: 1.0
}
layer {
  name: "acc_3"
  type: "Accuracy"
  bottom: "out_3"
  bottom: "label"
  top: "acc_3"
}
layer {
  name: "concat_4"
  type: "Concat"
  bottom: "scale_2"
  bottom: "scale_4"
  bottom: "scale_6"
  top: "concat_4"
}
layer {
  name: "groupdrop_4"
  type: "GroupDropout"
  bottom: "concat_4"
  top: "groupdrop_4"
  group_dropout_param {
    group_use: 2
    group_total: 3
  }
}
layer {
  name: "fc_22"
  type: "InnerProduct"
  bottom: "groupdrop_4"
  top: "fc_22"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_22"
  type: "ReLU"
  bottom: "fc_22"
  top: "fc_22"
}
layer {
  name: "drop_1"
  type: "Dropout"
  bottom: "fc_22"
  top: "drop_1"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "out_4"
  type: "InnerProduct"
  bottom: "drop_1"
  top: "out_4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 20
    weight_filler {
      type: "xavier"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "sigmoid_16"
  type: "Sigmoid"
  bottom: "out_4"
  top: "sigmoid_16"
}
layer {
  name: "silence_5"
  type: "Silence"
  bottom: "sigmoid_16"
}
layer {
  name: "silence_6"
  type: "Silence"
  bottom: "label_muti"
}
layer {
  name: "loss_10"
  type: "SoftmaxWithLoss"
  bottom: "out_4"
  bottom: "label"
  top: "loss_10"
  loss_weight: 1
  loss_param {
    ignore_label: 0
  }
}
layer {
  name: "acc_4"
  type: "Accuracy"
  bottom: "out_4"
  bottom: "label"
  top: "acc_4"
}
layer {
  name: "silence_7"
  type: "Silence"
  bottom: "sim"
}
