name: "Sauron Net"
# note: 
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  data_param {
    source: "./abs.h5"
    batch_size: 128
    backend: LMDB
  }
}
layer {
  name: "Slice1"
  type: "Slice"
  bottom: "data"
  top: "Slice1"
  top: "Slice2"
  top: "Slice3"
  top: "Slice4"
  top: "Slice5"
  top: "Slice6"
  top: "Slice7"
  top: "Slice8"
  top: "Slice9"
  top: "Slice10"
  top: "Slice11"
  top: "Slice12"
  top: "Slice13"
  top: "Slice14"
  top: "Slice15"
  top: "Slice16"
  top: "Slice17"
  top: "Slice18"
  top: "Slice19"
  top: "Slice20"
  top: "Slice21"
  top: "Slice22"
  top: "Slice23"
  top: "Slice24"
  top: "Slice25"
  top: "Slice26"
  top: "Slice27"
  top: "Slice28"
  top: "Slice29"
  top: "Slice30"
  top: "Slice31"
  top: "Slice32"
  top: "Slice33"
  top: "Slice34"
  top: "Slice35"
  top: "Slice36"
  top: "Slice37"
  top: "Slice38"
  top: "Slice39"
  top: "Slice40"
  top: "Slice41"
  top: "Slice42"
  top: "Slice43"
  top: "Slice44"
  top: "Slice45"
  top: "Slice46"
  top: "Slice47"
  top: "Slice48"
  top: "Slice49"
  top: "Slice50"
  top: "Slice51"
  top: "Slice52"
  top: "Slice53"
  top: "Slice54"
  top: "Slice55"
  top: "Slice56"
  top: "Slice57"
  top: "Slice58"
  top: "Slice59"
  top: "Slice60"
  top: "Slice61"
  top: "Slice62"
  top: "Slice63"
  top: "Slice64"
  top: "Slice65"
  top: "Slice66"
  top: "Slice67"
  top: "Slice68"
  top: "Slice69"
  top: "Slice70"
  top: "Slice71"
  top: "Slice72"
  top: "Slice73"
  top: "Slice74"
  top: "Slice75"
  top: "Slice76"
  top: "Slice77"
  top: "Slice78"
  top: "Slice79"
  top: "Slice80"
  top: "Slice81"
  top: "Slice82"
  top: "Slice83"
  top: "Slice84"
  top: "Slice85"
  top: "Slice86"
  top: "Slice87"
  top: "Slice88"
  top: "Slice89"
  top: "Slice90"
  top: "Slice91"
  top: "Slice92"
  top: "Slice93"
  top: "Slice94"
  top: "Slice95"
  top: "Slice96"
  top: "Slice97"
  top: "Slice98"
  top: "Slice99"
  top: "Slice100"
  top: "Slice101"
  top: "Slice102"
  top: "Slice103"
  top: "Slice104"
  top: "Slice105"
  top: "Slice106"
  top: "Slice107"
  top: "Slice108"
  top: "Slice109"
  top: "Slice110"
  top: "Slice111"
  top: "Slice112"
  top: "Slice113"
  top: "Slice114"
  top: "Slice115"
  top: "Slice116"
  top: "Slice117"
  top: "Slice118"
  top: "Slice119"
  top: "Slice120"
  top: "Slice121"
  top: "Slice122"
  top: "Slice123"
  top: "Slice124"
  top: "Slice125"
  top: "Slice126"
  top: "Slice127"
  top: "Slice128"
  top: "Slice129"
  top: "Slice130"
  top: "Slice131"
  top: "Slice132"
  top: "Slice133"
  top: "Slice134"
  top: "Slice135"
  top: "Slice136"
  top: "Slice137"
  top: "Slice138"
  top: "Slice139"
  top: "Slice140"
  top: "Slice141"
  top: "Slice142"
  top: "Slice143"
  top: "Slice144"
  top: "Slice145"
  top: "Slice146"
  top: "Slice147"
  top: "Slice148"
  top: "Slice149"
  top: "Slice150"
  top: "Slice151"
  top: "Slice152"
  top: "Slice153"
  top: "Slice154"
  top: "Slice155"
  top: "Slice156"
  top: "Slice157"
  top: "Slice158"
  top: "Slice159"
  top: "Slice160"
  top: "Slice161"
  top: "Slice162"
  top: "Slice163"
  top: "Slice164"
  top: "Slice165"
  top: "Slice166"
  top: "Slice167"
  top: "Slice168"
  top: "Slice169"
  top: "Slice170"
  top: "Slice171"
  top: "Slice172"
  top: "Slice173"
  top: "Slice174"
  top: "Slice175"
  top: "Slice176"
  top: "Slice177"
  top: "Slice178"
  top: "Slice179"
  top: "Slice180"
  top: "Slice181"
  top: "Slice182"
  top: "Slice183"
  top: "Slice184"
  top: "Slice185"
  top: "Slice186"
  top: "Slice187"
  top: "Slice188"
  top: "Slice189"
  top: "Slice190"
  top: "Slice191"
  top: "Slice192"
  top: "Slice193"
  top: "Slice194"
  top: "Slice195"
  top: "Slice196"
  top: "Slice197"
  top: "Slice198"
  top: "Slice199"
  top: "Slice200"
  top: "Slice201"
  top: "Slice202"
  top: "Slice203"
  top: "Slice204"
  top: "Slice205"
  top: "Slice206"
  top: "Slice207"
  top: "Slice208"
  top: "Slice209"
  top: "Slice210"
  top: "Slice211"
  top: "Slice212"
  top: "Slice213"
  top: "Slice214"
  top: "Slice215"
  top: "Slice216"
  top: "Slice217"
  top: "Slice218"
  top: "Slice219"
  top: "Slice220"
  top: "Slice221"
  top: "Slice222"
  top: "Slice223"
  top: "Slice224"
  top: "Slice225"
  top: "Slice226"
  top: "Slice227"
  top: "Slice228"
  top: "Slice229"
  top: "Slice230"
  top: "Slice231"
  top: "Slice232"
  top: "Slice233"
  top: "Slice234"
  top: "Slice235"
  top: "Slice236"
  top: "Slice237"
  top: "Slice238"
  top: "Slice239"
  top: "Slice240"
  top: "Slice241"
  top: "Slice242"
  top: "Slice243"
  top: "Slice244"
  top: "Slice245"
  top: "Slice246"
  top: "Slice247"
  top: "Slice248"
  top: "Slice249"
  top: "Slice250"
  top: "Slice251"
  top: "Slice252"
  top: "Slice253"
  top: "Slice254"
  top: "Slice255"
  top: "Slice256"
  top: "Slice257"
  top: "Slice258"
  top: "Slice259"
  top: "Slice260"
  top: "Slice261"
  top: "Slice262"
  top: "Slice263"
  top: "Slice264"
  top: "Slice265"
  top: "Slice266"
  top: "Slice267"
  top: "Slice268"
  top: "Slice269"
  top: "Slice270"
  top: "Slice271"
  top: "Slice272"
  top: "Slice273"
  top: "Slice274"
  top: "Slice275"
  top: "Slice276"
  top: "Slice277"
  top: "Slice278"
  top: "Slice279"
  top: "Slice280"
  top: "Slice281"
  top: "Slice282"
  top: "Slice283"
  top: "Slice284"
  top: "Slice285"
  top: "Slice286"
  top: "Slice287"
  top: "Slice288"
  top: "Slice289"
  top: "Slice290"
  top: "Slice291"
  top: "Slice292"
  top: "Slice293"
  top: "Slice294"
  top: "Slice295"
  top: "Slice296"
  top: "Slice297"
  top: "Slice298"
  top: "Slice299"
  top: "Slice300"
  top: "Slice301"
  top: "Slice302"
  top: "Slice303"
  top: "Slice304"
  top: "Slice305"
  top: "Slice306"
  top: "Slice307"
  top: "Slice308"
  top: "Slice309"
  top: "Slice310"
  top: "Slice311"
  top: "Slice312"
  top: "Slice313"
  top: "Slice314"
  top: "Slice315"
  top: "Slice316"
  top: "Slice317"
  top: "Slice318"
  top: "Slice319"
  top: "Slice320"
  top: "Slice321"
  top: "Slice322"
  top: "Slice323"
  top: "Slice324"
  top: "Slice325"
  top: "Slice326"
  top: "Slice327"
  top: "Slice328"
  top: "Slice329"
  top: "Slice330"
  top: "Slice331"
  top: "Slice332"
  top: "Slice333"
  top: "Slice334"
  top: "Slice335"
  top: "Slice336"
  top: "Slice337"
  top: "Slice338"
  top: "Slice339"
  top: "Slice340"
  top: "Slice341"
  top: "Slice342"
  top: "Slice343"
  top: "Slice344"
  top: "Slice345"
  top: "Slice346"
  top: "Slice347"
  top: "Slice348"
  top: "Slice349"
  top: "Slice350"
  top: "Slice351"
  top: "Slice352"
  top: "Slice353"
  top: "Slice354"
  top: "Slice355"
  top: "Slice356"
  top: "Slice357"
  top: "Slice358"
  top: "Slice359"
  top: "Slice360"
  top: "Slice361"
  top: "Slice362"
  top: "Slice363"
  top: "Slice364"
  top: "Slice365"
  top: "Slice366"
  top: "Slice367"
  top: "Slice368"
  top: "Slice369"
  top: "Slice370"
  top: "Slice371"
  top: "Slice372"
  top: "Slice373"
  top: "Slice374"
  top: "Slice375"
  top: "Slice376"
  top: "Slice377"
  top: "Slice378"
  top: "Slice379"
  top: "Slice380"
  top: "Slice381"
  top: "Slice382"
  top: "Slice383"
  top: "Slice384"
  top: "Slice385"
  top: "Slice386"
  top: "Slice387"
  top: "Slice388"
  top: "Slice389"
  top: "Slice390"
  top: "Slice391"
  top: "Slice392"
  top: "Slice393"
  top: "Slice394"
  top: "Slice395"
  top: "Slice396"
  top: "Slice397"
  top: "Slice398"
  top: "Slice399"
  top: "Slice400"
  top: "Slice401"
  top: "Slice402"
  top: "Slice403"
  top: "Slice404"
  top: "Slice405"
  top: "Slice406"
  top: "Slice407"
  top: "Slice408"
  top: "Slice409"
  top: "Slice410"
  top: "Slice411"
  top: "Slice412"
  top: "Slice413"
  top: "Slice414"
  top: "Slice415"
  top: "Slice416"
  top: "Slice417"
  top: "Slice418"
  top: "Slice419"
  top: "Slice420"
  top: "Slice421"
  top: "Slice422"
  top: "Slice423"
  top: "Slice424"
  top: "Slice425"
  top: "Slice426"
  top: "Slice427"
  top: "Slice428"
  top: "Slice429"
  top: "Slice430"
  top: "Slice431"
  top: "Slice432"
  top: "Slice433"
  top: "Slice434"
  top: "Slice435"
  top: "Slice436"
  top: "Slice437"
  top: "Slice438"
  top: "Slice439"
  top: "Slice440"
  top: "Slice441"
  top: "Slice442"
  top: "Slice443"
  top: "Slice444"
  top: "Slice445"
  top: "Slice446"
  top: "Slice447"
  top: "Slice448"
  top: "Slice449"
  top: "Slice450"
  top: "Slice451"
  top: "Slice452"
  top: "Slice453"
  top: "Slice454"
  top: "Slice455"
  top: "Slice456"
  top: "Slice457"
  top: "Slice458"
  top: "Slice459"
  top: "Slice460"
  top: "Slice461"
  top: "Slice462"
  top: "Slice463"
  top: "Slice464"
  top: "Slice465"
  top: "Slice466"
  top: "Slice467"
  top: "Slice468"
  top: "Slice469"
  top: "Slice470"
  top: "Slice471"
  top: "Slice472"
  top: "Slice473"
  top: "Slice474"
  top: "Slice475"
  top: "Slice476"
  top: "Slice477"
  top: "Slice478"
  top: "Slice479"
  top: "Slice480"
  top: "Slice481"
  top: "Slice482"
  top: "Slice483"
  top: "Slice484"
  top: "Slice485"
  top: "Slice486"
  top: "Slice487"
  top: "Slice488"
  top: "Slice489"
  top: "Slice490"
  top: "Slice491"
  top: "Slice492"
  top: "Slice493"
  top: "Slice494"
  top: "Slice495"
  top: "Slice496"
  top: "Slice497"
  top: "Slice498"
  top: "Slice499"
  top: "Slice500"
  top: "Slice501"
  top: "Slice502"
  top: "Slice503"
  top: "Slice504"
  top: "Slice505"
  top: "Slice506"
  top: "Slice507"
  top: "Slice508"
  top: "Slice509"
  top: "Slice510"
  top: "Slice511"
  top: "Slice512"
  top: "Slice513"
  top: "Slice514"
  top: "Slice515"
  top: "Slice516"
  top: "Slice517"
  top: "Slice518"
  top: "Slice519"
  top: "Slice520"
  top: "Slice521"
  top: "Slice522"
  top: "Slice523"
  top: "Slice524"
  top: "Slice525"
  top: "Slice526"
  top: "Slice527"
  top: "Slice528"
  top: "Slice529"
  top: "Slice530"
  top: "Slice531"
  top: "Slice532"
  top: "Slice533"
  top: "Slice534"
  top: "Slice535"
  top: "Slice536"
  top: "Slice537"
  top: "Slice538"
  top: "Slice539"
  top: "Slice540"
  top: "Slice541"
  top: "Slice542"
  top: "Slice543"
  top: "Slice544"
  top: "Slice545"
  top: "Slice546"
  top: "Slice547"
  top: "Slice548"
  top: "Slice549"
  top: "Slice550"
  top: "Slice551"
  top: "Slice552"
  top: "Slice553"
  top: "Slice554"
  top: "Slice555"
  top: "Slice556"
  top: "Slice557"
  top: "Slice558"
  top: "Slice559"
  top: "Slice560"
  top: "Slice561"
  top: "Slice562"
  top: "Slice563"
  top: "Slice564"
  top: "Slice565"
  top: "Slice566"
  top: "Slice567"
  top: "Slice568"
  top: "Slice569"
  top: "Slice570"
  top: "Slice571"
  top: "Slice572"
  top: "Slice573"
  top: "Slice574"
  top: "Slice575"
  top: "Slice576"
  top: "Slice577"
  top: "Slice578"
  top: "Slice579"
  top: "Slice580"
  top: "Slice581"
  top: "Slice582"
  top: "Slice583"
  top: "Slice584"
  top: "Slice585"
  top: "Slice586"
  top: "Slice587"
  top: "Slice588"
  top: "Slice589"
  top: "Slice590"
  top: "Slice591"
  top: "Slice592"
  top: "Slice593"
  top: "Slice594"
  top: "Slice595"
  top: "Slice596"
  top: "Slice597"
  top: "Slice598"
  top: "Slice599"
  top: "Slice600"
  top: "Slice601"
  top: "Slice602"
  top: "Slice603"
  top: "Slice604"
  top: "Slice605"
  top: "Slice606"
  top: "Slice607"
  top: "Slice608"
  top: "Slice609"
  top: "Slice610"
  top: "Slice611"
  top: "Slice612"
  top: "Slice613"
  top: "Slice614"
  top: "Slice615"
  top: "Slice616"
  top: "Slice617"
  top: "Slice618"
  top: "Slice619"
  top: "Slice620"
  top: "Slice621"
  top: "Slice622"
  top: "Slice623"
  top: "Slice624"
  top: "Slice625"
  top: "Slice626"
  top: "Slice627"
  top: "Slice628"
  top: "Slice629"
  top: "Slice630"
  top: "Slice631"
  top: "Slice632"
  top: "Slice633"
  top: "Slice634"
  top: "Slice635"
  top: "Slice636"
  top: "Slice637"
  top: "Slice638"
  top: "Slice639"
  top: "Slice640"
  top: "Slice641"
  top: "Slice642"
  top: "Slice643"
  top: "Slice644"
  top: "Slice645"
  top: "Slice646"
  top: "Slice647"
  top: "Slice648"
  top: "Slice649"
  top: "Slice650"
  top: "Slice651"
  top: "Slice652"
  top: "Slice653"
  top: "Slice654"
  top: "Slice655"
  top: "Slice656"
  top: "Slice657"
  top: "Slice658"
  top: "Slice659"
  top: "Slice660"
  top: "Slice661"
  top: "Slice662"
  top: "Slice663"
  top: "Slice664"
  top: "Slice665"
  top: "Slice666"
  top: "Slice667"
  top: "Slice668"
  top: "Slice669"
  top: "Slice670"
  top: "Slice671"
  top: "Slice672"
  top: "Slice673"
  top: "Slice674"
  top: "Slice675"
  top: "Slice676"
  top: "Slice677"
  top: "Slice678"
  top: "Slice679"
  top: "Slice680"
  top: "Slice681"
  top: "Slice682"
  top: "Slice683"
  top: "Slice684"
  top: "Slice685"
  top: "Slice686"
  top: "Slice687"
  top: "Slice688"
  top: "Slice689"
  top: "Slice690"
  top: "Slice691"
  top: "Slice692"
  top: "Slice693"
  top: "Slice694"
  top: "Slice695"
  top: "Slice696"
  top: "Slice697"
  top: "Slice698"
  top: "Slice699"
  top: "Slice700"
  top: "Slice701"
  top: "Slice702"
  top: "Slice703"
  top: "Slice704"
  top: "Slice705"
  top: "Slice706"
  top: "Slice707"
  top: "Slice708"
  top: "Slice709"
  top: "Slice710"
  top: "Slice711"
  top: "Slice712"
  top: "Slice713"
  top: "Slice714"
  top: "Slice715"
  top: "Slice716"
  top: "Slice717"
  top: "Slice718"
  top: "Slice719"
  top: "Slice720"
  top: "Slice721"
  top: "Slice722"
  top: "Slice723"
  top: "Slice724"
  top: "Slice725"
  top: "Slice726"
  top: "Slice727"
  top: "Slice728"
  top: "Slice729"
  top: "Slice730"
  top: "Slice731"
  top: "Slice732"
  top: "Slice733"
  top: "Slice734"
  top: "Slice735"
  top: "Slice736"
  top: "Slice737"
  top: "Slice738"
  top: "Slice739"
  top: "Slice740"
  top: "Slice741"
  top: "Slice742"
  top: "Slice743"
  top: "Slice744"
  top: "Slice745"
  top: "Slice746"
  top: "Slice747"
  top: "Slice748"
  top: "Slice749"
  top: "Slice750"
  top: "Slice751"
  top: "Slice752"
  top: "Slice753"
  top: "Slice754"
  top: "Slice755"
  top: "Slice756"
  top: "Slice757"
  top: "Slice758"
  top: "Slice759"
  top: "Slice760"
  top: "Slice761"
  top: "Slice762"
  top: "Slice763"
  top: "Slice764"
  top: "Slice765"
  top: "Slice766"
  top: "Slice767"
  top: "Slice768"
  top: "Slice769"
  top: "Slice770"
  top: "Slice771"
  top: "Slice772"
  top: "Slice773"
  top: "Slice774"
  top: "Slice775"
  top: "Slice776"
  top: "Slice777"
  top: "Slice778"
  top: "Slice779"
  top: "Slice780"
  top: "Slice781"
  top: "Slice782"
  top: "Slice783"
  top: "Slice784"
  top: "Slice785"
  top: "Slice786"
  top: "Slice787"
  top: "Slice788"
  top: "Slice789"
  top: "Slice790"
  top: "Slice791"
  top: "Slice792"
  top: "Slice793"
  top: "Slice794"
  top: "Slice795"
  top: "Slice796"
  top: "Slice797"
  top: "Slice798"
  top: "Slice799"
  top: "Slice800"
  top: "Slice801"
  top: "Slice802"
  top: "Slice803"
  top: "Slice804"
  top: "Slice805"
  top: "Slice806"
  top: "Slice807"
  top: "Slice808"
  top: "Slice809"
  top: "Slice810"
  top: "Slice811"
  top: "Slice812"
  top: "Slice813"
  top: "Slice814"
  top: "Slice815"
  top: "Slice816"
  top: "Slice817"
  top: "Slice818"
  top: "Slice819"
  top: "Slice820"
  top: "Slice821"
  top: "Slice822"
  top: "Slice823"
  top: "Slice824"
  top: "Slice825"
  top: "Slice826"
  top: "Slice827"
  top: "Slice828"
  top: "Slice829"
  top: "Slice830"
  top: "Slice831"
  top: "Slice832"
  top: "Slice833"
  top: "Slice834"
  top: "Slice835"
  top: "Slice836"
  top: "Slice837"
  top: "Slice838"
  top: "Slice839"
  top: "Slice840"
  top: "Slice841"
  top: "Slice842"
  top: "Slice843"
  top: "Slice844"
  top: "Slice845"
  top: "Slice846"
  top: "Slice847"
  top: "Slice848"
  top: "Slice849"
  top: "Slice850"
  top: "Slice851"
  top: "Slice852"
  top: "Slice853"
  top: "Slice854"
  top: "Slice855"
  top: "Slice856"
  top: "Slice857"
  top: "Slice858"
  top: "Slice859"
  top: "Slice860"
  top: "Slice861"
  top: "Slice862"
  top: "Slice863"
  top: "Slice864"
  top: "Slice865"
  top: "Slice866"
  top: "Slice867"
  top: "Slice868"
  top: "Slice869"
  top: "Slice870"
  top: "Slice871"
  top: "Slice872"
  top: "Slice873"
  top: "Slice874"
  top: "Slice875"
  top: "Slice876"
  top: "Slice877"
  top: "Slice878"
  top: "Slice879"
  top: "Slice880"
  top: "Slice881"
  top: "Slice882"
  top: "Slice883"
  top: "Slice884"
  top: "Slice885"
  top: "Slice886"
  top: "Slice887"
  top: "Slice888"
  top: "Slice889"
  top: "Slice890"
  top: "Slice891"
  top: "Slice892"
  top: "Slice893"
  top: "Slice894"
  top: "Slice895"
  top: "Slice896"
  top: "Slice897"
  top: "Slice898"
  top: "Slice899"
  top: "Slice900"
  top: "Slice901"
  top: "Slice902"
  top: "Slice903"
  top: "Slice904"
  top: "Slice905"
  top: "Slice906"
  top: "Slice907"
  top: "Slice908"
  top: "Slice909"
  top: "Slice910"
  top: "Slice911"
  top: "Slice912"
  top: "Slice913"
  top: "Slice914"
  top: "Slice915"
  top: "Slice916"
  top: "Slice917"
  top: "Slice918"
  top: "Slice919"
  top: "Slice920"
  top: "Slice921"
  top: "Slice922"
  top: "Slice923"
  top: "Slice924"
  top: "Slice925"
  top: "Slice926"
  top: "Slice927"
  top: "Slice928"
  top: "Slice929"
  top: "Slice930"
  top: "Slice931"
  top: "Slice932"
  top: "Slice933"
  top: "Slice934"
  top: "Slice935"
  top: "Slice936"
  top: "Slice937"
  top: "Slice938"
  top: "Slice939"
  top: "Slice940"
  top: "Slice941"
  top: "Slice942"
  top: "Slice943"
  top: "Slice944"
  top: "Slice945"
  top: "Slice946"
  top: "Slice947"
  top: "Slice948"
  top: "Slice949"
  top: "Slice950"
  top: "Slice951"
  top: "Slice952"
  top: "Slice953"
  top: "Slice954"
  top: "Slice955"
  top: "Slice956"
  top: "Slice957"
  top: "Slice958"
  top: "Slice959"
  top: "Slice960"
  top: "Slice961"
  top: "Slice962"
  top: "Slice963"
  top: "Slice964"
  top: "Slice965"
  top: "Slice966"
  top: "Slice967"
  top: "Slice968"
  top: "Slice969"
  top: "Slice970"
  top: "Slice971"
  top: "Slice972"
  top: "Slice973"
  top: "Slice974"
  top: "Slice975"
  top: "Slice976"
  top: "Slice977"
  top: "Slice978"
  top: "Slice979"
  top: "Slice980"
  top: "Slice981"
  top: "Slice982"
  top: "Slice983"
  top: "Slice984"
  top: "Slice985"
  top: "Slice986"
  top: "Slice987"
  top: "Slice988"
  top: "Slice989"
  top: "Slice990"
  top: "Slice991"
  top: "Slice992"
  top: "Slice993"
  top: "Slice994"
  top: "Slice995"
  top: "Slice996"
  top: "Slice997"
  top: "Slice998"
  top: "Slice999"
  top: "Slice1000"
  slice_param {
    slice_point: 900
    slice_point: 1800
    slice_point: 2700
    slice_point: 3600
    slice_point: 4500
    slice_point: 5400
    slice_point: 6300
    slice_point: 7200
    slice_point: 8100
    slice_point: 9000
    slice_point: 9900
    slice_point: 10800
    slice_point: 11700
    slice_point: 12600
    slice_point: 13500
    slice_point: 14400
    slice_point: 15300
    slice_point: 16200
    slice_point: 17100
    slice_point: 18000
    slice_point: 18900
    slice_point: 19800
    slice_point: 20700
    slice_point: 21600
    slice_point: 22500
    slice_point: 23400
    slice_point: 24300
    slice_point: 25200
    slice_point: 26100
    slice_point: 27000
    slice_point: 27900
    slice_point: 28800
    slice_point: 29700
    slice_point: 30600
    slice_point: 31500
    slice_point: 32400
    slice_point: 33300
    slice_point: 34200
    slice_point: 35100
    slice_point: 36000
    slice_point: 36900
    slice_point: 37800
    slice_point: 38700
    slice_point: 39600
    slice_point: 40500
    slice_point: 41400
    slice_point: 42300
    slice_point: 43200
    slice_point: 44100
    slice_point: 45000
    slice_point: 45900
    slice_point: 46800
    slice_point: 47700
    slice_point: 48600
    slice_point: 49500
    slice_point: 50400
    slice_point: 51300
    slice_point: 52200
    slice_point: 53100
    slice_point: 54000
    slice_point: 54900
    slice_point: 55800
    slice_point: 56700
    slice_point: 57600
    slice_point: 58500
    slice_point: 59400
    slice_point: 60300
    slice_point: 61200
    slice_point: 62100
    slice_point: 63000
    slice_point: 63900
    slice_point: 64800
    slice_point: 65700
    slice_point: 66600
    slice_point: 67500
    slice_point: 68400
    slice_point: 69300
    slice_point: 70200
    slice_point: 71100
    slice_point: 72000
    slice_point: 72900
    slice_point: 73800
    slice_point: 74700
    slice_point: 75600
    slice_point: 76500
    slice_point: 77400
    slice_point: 78300
    slice_point: 79200
    slice_point: 80100
    slice_point: 81000
    slice_point: 81900
    slice_point: 82800
    slice_point: 83700
    slice_point: 84600
    slice_point: 85500
    slice_point: 86400
    slice_point: 87300
    slice_point: 88200
    slice_point: 89100
    slice_point: 90000
    slice_point: 90900
    slice_point: 91800
    slice_point: 92700
    slice_point: 93600
    slice_point: 94500
    slice_point: 95400
    slice_point: 96300
    slice_point: 97200
    slice_point: 98100
    slice_point: 99000
    slice_point: 99900
    slice_point: 100800
    slice_point: 101700
    slice_point: 102600
    slice_point: 103500
    slice_point: 104400
    slice_point: 105300
    slice_point: 106200
    slice_point: 107100
    slice_point: 108000
    slice_point: 108900
    slice_point: 109800
    slice_point: 110700
    slice_point: 111600
    slice_point: 112500
    slice_point: 113400
    slice_point: 114300
    slice_point: 115200
    slice_point: 116100
    slice_point: 117000
    slice_point: 117900
    slice_point: 118800
    slice_point: 119700
    slice_point: 120600
    slice_point: 121500
    slice_point: 122400
    slice_point: 123300
    slice_point: 124200
    slice_point: 125100
    slice_point: 126000
    slice_point: 126900
    slice_point: 127800
    slice_point: 128700
    slice_point: 129600
    slice_point: 130500
    slice_point: 131400
    slice_point: 132300
    slice_point: 133200
    slice_point: 134100
    slice_point: 135000
    slice_point: 135900
    slice_point: 136800
    slice_point: 137700
    slice_point: 138600
    slice_point: 139500
    slice_point: 140400
    slice_point: 141300
    slice_point: 142200
    slice_point: 143100
    slice_point: 144000
    slice_point: 144900
    slice_point: 145800
    slice_point: 146700
    slice_point: 147600
    slice_point: 148500
    slice_point: 149400
    slice_point: 150300
    slice_point: 151200
    slice_point: 152100
    slice_point: 153000
    slice_point: 153900
    slice_point: 154800
    slice_point: 155700
    slice_point: 156600
    slice_point: 157500
    slice_point: 158400
    slice_point: 159300
    slice_point: 160200
    slice_point: 161100
    slice_point: 162000
    slice_point: 162900
    slice_point: 163800
    slice_point: 164700
    slice_point: 165600
    slice_point: 166500
    slice_point: 167400
    slice_point: 168300
    slice_point: 169200
    slice_point: 170100
    slice_point: 171000
    slice_point: 171900
    slice_point: 172800
    slice_point: 173700
    slice_point: 174600
    slice_point: 175500
    slice_point: 176400
    slice_point: 177300
    slice_point: 178200
    slice_point: 179100
    slice_point: 180000
    slice_point: 180900
    slice_point: 181800
    slice_point: 182700
    slice_point: 183600
    slice_point: 184500
    slice_point: 185400
    slice_point: 186300
    slice_point: 187200
    slice_point: 188100
    slice_point: 189000
    slice_point: 189900
    slice_point: 190800
    slice_point: 191700
    slice_point: 192600
    slice_point: 193500
    slice_point: 194400
    slice_point: 195300
    slice_point: 196200
    slice_point: 197100
    slice_point: 198000
    slice_point: 198900
    slice_point: 199800
    slice_point: 200700
    slice_point: 201600
    slice_point: 202500
    slice_point: 203400
    slice_point: 204300
    slice_point: 205200
    slice_point: 206100
    slice_point: 207000
    slice_point: 207900
    slice_point: 208800
    slice_point: 209700
    slice_point: 210600
    slice_point: 211500
    slice_point: 212400
    slice_point: 213300
    slice_point: 214200
    slice_point: 215100
    slice_point: 216000
    slice_point: 216900
    slice_point: 217800
    slice_point: 218700
    slice_point: 219600
    slice_point: 220500
    slice_point: 221400
    slice_point: 222300
    slice_point: 223200
    slice_point: 224100
    slice_point: 225000
    slice_point: 225900
    slice_point: 226800
    slice_point: 227700
    slice_point: 228600
    slice_point: 229500
    slice_point: 230400
    slice_point: 231300
    slice_point: 232200
    slice_point: 233100
    slice_point: 234000
    slice_point: 234900
    slice_point: 235800
    slice_point: 236700
    slice_point: 237600
    slice_point: 238500
    slice_point: 239400
    slice_point: 240300
    slice_point: 241200
    slice_point: 242100
    slice_point: 243000
    slice_point: 243900
    slice_point: 244800
    slice_point: 245700
    slice_point: 246600
    slice_point: 247500
    slice_point: 248400
    slice_point: 249300
    slice_point: 250200
    slice_point: 251100
    slice_point: 252000
    slice_point: 252900
    slice_point: 253800
    slice_point: 254700
    slice_point: 255600
    slice_point: 256500
    slice_point: 257400
    slice_point: 258300
    slice_point: 259200
    slice_point: 260100
    slice_point: 261000
    slice_point: 261900
    slice_point: 262800
    slice_point: 263700
    slice_point: 264600
    slice_point: 265500
    slice_point: 266400
    slice_point: 267300
    slice_point: 268200
    slice_point: 269100
    slice_point: 270000
    slice_point: 270900
    slice_point: 271800
    slice_point: 272700
    slice_point: 273600
    slice_point: 274500
    slice_point: 275400
    slice_point: 276300
    slice_point: 277200
    slice_point: 278100
    slice_point: 279000
    slice_point: 279900
    slice_point: 280800
    slice_point: 281700
    slice_point: 282600
    slice_point: 283500
    slice_point: 284400
    slice_point: 285300
    slice_point: 286200
    slice_point: 287100
    slice_point: 288000
    slice_point: 288900
    slice_point: 289800
    slice_point: 290700
    slice_point: 291600
    slice_point: 292500
    slice_point: 293400
    slice_point: 294300
    slice_point: 295200
    slice_point: 296100
    slice_point: 297000
    slice_point: 297900
    slice_point: 298800
    slice_point: 299700
    slice_point: 300600
    slice_point: 301500
    slice_point: 302400
    slice_point: 303300
    slice_point: 304200
    slice_point: 305100
    slice_point: 306000
    slice_point: 306900
    slice_point: 307800
    slice_point: 308700
    slice_point: 309600
    slice_point: 310500
    slice_point: 311400
    slice_point: 312300
    slice_point: 313200
    slice_point: 314100
    slice_point: 315000
    slice_point: 315900
    slice_point: 316800
    slice_point: 317700
    slice_point: 318600
    slice_point: 319500
    slice_point: 320400
    slice_point: 321300
    slice_point: 322200
    slice_point: 323100
    slice_point: 324000
    slice_point: 324900
    slice_point: 325800
    slice_point: 326700
    slice_point: 327600
    slice_point: 328500
    slice_point: 329400
    slice_point: 330300
    slice_point: 331200
    slice_point: 332100
    slice_point: 333000
    slice_point: 333900
    slice_point: 334800
    slice_point: 335700
    slice_point: 336600
    slice_point: 337500
    slice_point: 338400
    slice_point: 339300
    slice_point: 340200
    slice_point: 341100
    slice_point: 342000
    slice_point: 342900
    slice_point: 343800
    slice_point: 344700
    slice_point: 345600
    slice_point: 346500
    slice_point: 347400
    slice_point: 348300
    slice_point: 349200
    slice_point: 350100
    slice_point: 351000
    slice_point: 351900
    slice_point: 352800
    slice_point: 353700
    slice_point: 354600
    slice_point: 355500
    slice_point: 356400
    slice_point: 357300
    slice_point: 358200
    slice_point: 359100
    slice_point: 360000
    slice_point: 360900
    slice_point: 361800
    slice_point: 362700
    slice_point: 363600
    slice_point: 364500
    slice_point: 365400
    slice_point: 366300
    slice_point: 367200
    slice_point: 368100
    slice_point: 369000
    slice_point: 369900
    slice_point: 370800
    slice_point: 371700
    slice_point: 372600
    slice_point: 373500
    slice_point: 374400
    slice_point: 375300
    slice_point: 376200
    slice_point: 377100
    slice_point: 378000
    slice_point: 378900
    slice_point: 379800
    slice_point: 380700
    slice_point: 381600
    slice_point: 382500
    slice_point: 383400
    slice_point: 384300
    slice_point: 385200
    slice_point: 386100
    slice_point: 387000
    slice_point: 387900
    slice_point: 388800
    slice_point: 389700
    slice_point: 390600
    slice_point: 391500
    slice_point: 392400
    slice_point: 393300
    slice_point: 394200
    slice_point: 395100
    slice_point: 396000
    slice_point: 396900
    slice_point: 397800
    slice_point: 398700
    slice_point: 399600
    slice_point: 400500
    slice_point: 401400
    slice_point: 402300
    slice_point: 403200
    slice_point: 404100
    slice_point: 405000
    slice_point: 405900
    slice_point: 406800
    slice_point: 407700
    slice_point: 408600
    slice_point: 409500
    slice_point: 410400
    slice_point: 411300
    slice_point: 412200
    slice_point: 413100
    slice_point: 414000
    slice_point: 414900
    slice_point: 415800
    slice_point: 416700
    slice_point: 417600
    slice_point: 418500
    slice_point: 419400
    slice_point: 420300
    slice_point: 421200
    slice_point: 422100
    slice_point: 423000
    slice_point: 423900
    slice_point: 424800
    slice_point: 425700
    slice_point: 426600
    slice_point: 427500
    slice_point: 428400
    slice_point: 429300
    slice_point: 430200
    slice_point: 431100
    slice_point: 432000
    slice_point: 432900
    slice_point: 433800
    slice_point: 434700
    slice_point: 435600
    slice_point: 436500
    slice_point: 437400
    slice_point: 438300
    slice_point: 439200
    slice_point: 440100
    slice_point: 441000
    slice_point: 441900
    slice_point: 442800
    slice_point: 443700
    slice_point: 444600
    slice_point: 445500
    slice_point: 446400
    slice_point: 447300
    slice_point: 448200
    slice_point: 449100
    slice_point: 450000
    slice_point: 450900
    slice_point: 451800
    slice_point: 452700
    slice_point: 453600
    slice_point: 454500
    slice_point: 455400
    slice_point: 456300
    slice_point: 457200
    slice_point: 458100
    slice_point: 459000
    slice_point: 459900
    slice_point: 460800
    slice_point: 461700
    slice_point: 462600
    slice_point: 463500
    slice_point: 464400
    slice_point: 465300
    slice_point: 466200
    slice_point: 467100
    slice_point: 468000
    slice_point: 468900
    slice_point: 469800
    slice_point: 470700
    slice_point: 471600
    slice_point: 472500
    slice_point: 473400
    slice_point: 474300
    slice_point: 475200
    slice_point: 476100
    slice_point: 477000
    slice_point: 477900
    slice_point: 478800
    slice_point: 479700
    slice_point: 480600
    slice_point: 481500
    slice_point: 482400
    slice_point: 483300
    slice_point: 484200
    slice_point: 485100
    slice_point: 486000
    slice_point: 486900
    slice_point: 487800
    slice_point: 488700
    slice_point: 489600
    slice_point: 490500
    slice_point: 491400
    slice_point: 492300
    slice_point: 493200
    slice_point: 494100
    slice_point: 495000
    slice_point: 495900
    slice_point: 496800
    slice_point: 497700
    slice_point: 498600
    slice_point: 499500
    slice_point: 500400
    slice_point: 501300
    slice_point: 502200
    slice_point: 503100
    slice_point: 504000
    slice_point: 504900
    slice_point: 505800
    slice_point: 506700
    slice_point: 507600
    slice_point: 508500
    slice_point: 509400
    slice_point: 510300
    slice_point: 511200
    slice_point: 512100
    slice_point: 513000
    slice_point: 513900
    slice_point: 514800
    slice_point: 515700
    slice_point: 516600
    slice_point: 517500
    slice_point: 518400
    slice_point: 519300
    slice_point: 520200
    slice_point: 521100
    slice_point: 522000
    slice_point: 522900
    slice_point: 523800
    slice_point: 524700
    slice_point: 525600
    slice_point: 526500
    slice_point: 527400
    slice_point: 528300
    slice_point: 529200
    slice_point: 530100
    slice_point: 531000
    slice_point: 531900
    slice_point: 532800
    slice_point: 533700
    slice_point: 534600
    slice_point: 535500
    slice_point: 536400
    slice_point: 537300
    slice_point: 538200
    slice_point: 539100
    slice_point: 540000
    slice_point: 540900
    slice_point: 541800
    slice_point: 542700
    slice_point: 543600
    slice_point: 544500
    slice_point: 545400
    slice_point: 546300
    slice_point: 547200
    slice_point: 548100
    slice_point: 549000
    slice_point: 549900
    slice_point: 550800
    slice_point: 551700
    slice_point: 552600
    slice_point: 553500
    slice_point: 554400
    slice_point: 555300
    slice_point: 556200
    slice_point: 557100
    slice_point: 558000
    slice_point: 558900
    slice_point: 559800
    slice_point: 560700
    slice_point: 561600
    slice_point: 562500
    slice_point: 563400
    slice_point: 564300
    slice_point: 565200
    slice_point: 566100
    slice_point: 567000
    slice_point: 567900
    slice_point: 568800
    slice_point: 569700
    slice_point: 570600
    slice_point: 571500
    slice_point: 572400
    slice_point: 573300
    slice_point: 574200
    slice_point: 575100
    slice_point: 576000
    slice_point: 576900
    slice_point: 577800
    slice_point: 578700
    slice_point: 579600
    slice_point: 580500
    slice_point: 581400
    slice_point: 582300
    slice_point: 583200
    slice_point: 584100
    slice_point: 585000
    slice_point: 585900
    slice_point: 586800
    slice_point: 587700
    slice_point: 588600
    slice_point: 589500
    slice_point: 590400
    slice_point: 591300
    slice_point: 592200
    slice_point: 593100
    slice_point: 594000
    slice_point: 594900
    slice_point: 595800
    slice_point: 596700
    slice_point: 597600
    slice_point: 598500
    slice_point: 599400
    slice_point: 600300
    slice_point: 601200
    slice_point: 602100
    slice_point: 603000
    slice_point: 603900
    slice_point: 604800
    slice_point: 605700
    slice_point: 606600
    slice_point: 607500
    slice_point: 608400
    slice_point: 609300
    slice_point: 610200
    slice_point: 611100
    slice_point: 612000
    slice_point: 612900
    slice_point: 613800
    slice_point: 614700
    slice_point: 615600
    slice_point: 616500
    slice_point: 617400
    slice_point: 618300
    slice_point: 619200
    slice_point: 620100
    slice_point: 621000
    slice_point: 621900
    slice_point: 622800
    slice_point: 623700
    slice_point: 624600
    slice_point: 625500
    slice_point: 626400
    slice_point: 627300
    slice_point: 628200
    slice_point: 629100
    slice_point: 630000
    slice_point: 630900
    slice_point: 631800
    slice_point: 632700
    slice_point: 633600
    slice_point: 634500
    slice_point: 635400
    slice_point: 636300
    slice_point: 637200
    slice_point: 638100
    slice_point: 639000
    slice_point: 639900
    slice_point: 640800
    slice_point: 641700
    slice_point: 642600
    slice_point: 643500
    slice_point: 644400
    slice_point: 645300
    slice_point: 646200
    slice_point: 647100
    slice_point: 648000
    slice_point: 648900
    slice_point: 649800
    slice_point: 650700
    slice_point: 651600
    slice_point: 652500
    slice_point: 653400
    slice_point: 654300
    slice_point: 655200
    slice_point: 656100
    slice_point: 657000
    slice_point: 657900
    slice_point: 658800
    slice_point: 659700
    slice_point: 660600
    slice_point: 661500
    slice_point: 662400
    slice_point: 663300
    slice_point: 664200
    slice_point: 665100
    slice_point: 666000
    slice_point: 666900
    slice_point: 667800
    slice_point: 668700
    slice_point: 669600
    slice_point: 670500
    slice_point: 671400
    slice_point: 672300
    slice_point: 673200
    slice_point: 674100
    slice_point: 675000
    slice_point: 675900
    slice_point: 676800
    slice_point: 677700
    slice_point: 678600
    slice_point: 679500
    slice_point: 680400
    slice_point: 681300
    slice_point: 682200
    slice_point: 683100
    slice_point: 684000
    slice_point: 684900
    slice_point: 685800
    slice_point: 686700
    slice_point: 687600
    slice_point: 688500
    slice_point: 689400
    slice_point: 690300
    slice_point: 691200
    slice_point: 692100
    slice_point: 693000
    slice_point: 693900
    slice_point: 694800
    slice_point: 695700
    slice_point: 696600
    slice_point: 697500
    slice_point: 698400
    slice_point: 699300
    slice_point: 700200
    slice_point: 701100
    slice_point: 702000
    slice_point: 702900
    slice_point: 703800
    slice_point: 704700
    slice_point: 705600
    slice_point: 706500
    slice_point: 707400
    slice_point: 708300
    slice_point: 709200
    slice_point: 710100
    slice_point: 711000
    slice_point: 711900
    slice_point: 712800
    slice_point: 713700
    slice_point: 714600
    slice_point: 715500
    slice_point: 716400
    slice_point: 717300
    slice_point: 718200
    slice_point: 719100
    slice_point: 720000
    slice_point: 720900
    slice_point: 721800
    slice_point: 722700
    slice_point: 723600
    slice_point: 724500
    slice_point: 725400
    slice_point: 726300
    slice_point: 727200
    slice_point: 728100
    slice_point: 729000
    slice_point: 729900
    slice_point: 730800
    slice_point: 731700
    slice_point: 732600
    slice_point: 733500
    slice_point: 734400
    slice_point: 735300
    slice_point: 736200
    slice_point: 737100
    slice_point: 738000
    slice_point: 738900
    slice_point: 739800
    slice_point: 740700
    slice_point: 741600
    slice_point: 742500
    slice_point: 743400
    slice_point: 744300
    slice_point: 745200
    slice_point: 746100
    slice_point: 747000
    slice_point: 747900
    slice_point: 748800
    slice_point: 749700
    slice_point: 750600
    slice_point: 751500
    slice_point: 752400
    slice_point: 753300
    slice_point: 754200
    slice_point: 755100
    slice_point: 756000
    slice_point: 756900
    slice_point: 757800
    slice_point: 758700
    slice_point: 759600
    slice_point: 760500
    slice_point: 761400
    slice_point: 762300
    slice_point: 763200
    slice_point: 764100
    slice_point: 765000
    slice_point: 765900
    slice_point: 766800
    slice_point: 767700
    slice_point: 768600
    slice_point: 769500
    slice_point: 770400
    slice_point: 771300
    slice_point: 772200
    slice_point: 773100
    slice_point: 774000
    slice_point: 774900
    slice_point: 775800
    slice_point: 776700
    slice_point: 777600
    slice_point: 778500
    slice_point: 779400
    slice_point: 780300
    slice_point: 781200
    slice_point: 782100
    slice_point: 783000
    slice_point: 783900
    slice_point: 784800
    slice_point: 785700
    slice_point: 786600
    slice_point: 787500
    slice_point: 788400
    slice_point: 789300
    slice_point: 790200
    slice_point: 791100
    slice_point: 792000
    slice_point: 792900
    slice_point: 793800
    slice_point: 794700
    slice_point: 795600
    slice_point: 796500
    slice_point: 797400
    slice_point: 798300
    slice_point: 799200
    slice_point: 800100
    slice_point: 801000
    slice_point: 801900
    slice_point: 802800
    slice_point: 803700
    slice_point: 804600
    slice_point: 805500
    slice_point: 806400
    slice_point: 807300
    slice_point: 808200
    slice_point: 809100
    slice_point: 810000
    slice_point: 810900
    slice_point: 811800
    slice_point: 812700
    slice_point: 813600
    slice_point: 814500
    slice_point: 815400
    slice_point: 816300
    slice_point: 817200
    slice_point: 818100
    slice_point: 819000
    slice_point: 819900
    slice_point: 820800
    slice_point: 821700
    slice_point: 822600
    slice_point: 823500
    slice_point: 824400
    slice_point: 825300
    slice_point: 826200
    slice_point: 827100
    slice_point: 828000
    slice_point: 828900
    slice_point: 829800
    slice_point: 830700
    slice_point: 831600
    slice_point: 832500
    slice_point: 833400
    slice_point: 834300
    slice_point: 835200
    slice_point: 836100
    slice_point: 837000
    slice_point: 837900
    slice_point: 838800
    slice_point: 839700
    slice_point: 840600
    slice_point: 841500
    slice_point: 842400
    slice_point: 843300
    slice_point: 844200
    slice_point: 845100
    slice_point: 846000
    slice_point: 846900
    slice_point: 847800
    slice_point: 848700
    slice_point: 849600
    slice_point: 850500
    slice_point: 851400
    slice_point: 852300
    slice_point: 853200
    slice_point: 854100
    slice_point: 855000
    slice_point: 855900
    slice_point: 856800
    slice_point: 857700
    slice_point: 858600
    slice_point: 859500
    slice_point: 860400
    slice_point: 861300
    slice_point: 862200
    slice_point: 863100
    slice_point: 864000
    slice_point: 864900
    slice_point: 865800
    slice_point: 866700
    slice_point: 867600
    slice_point: 868500
    slice_point: 869400
    slice_point: 870300
    slice_point: 871200
    slice_point: 872100
    slice_point: 873000
    slice_point: 873900
    slice_point: 874800
    slice_point: 875700
    slice_point: 876600
    slice_point: 877500
    slice_point: 878400
    slice_point: 879300
    slice_point: 880200
    slice_point: 881100
    slice_point: 882000
    slice_point: 882900
    slice_point: 883800
    slice_point: 884700
    slice_point: 885600
    slice_point: 886500
    slice_point: 887400
    slice_point: 888300
    slice_point: 889200
    slice_point: 890100
    slice_point: 891000
    slice_point: 891900
    slice_point: 892800
    slice_point: 893700
    slice_point: 894600
    slice_point: 895500
    slice_point: 896400
    slice_point: 897300
    slice_point: 898200
    slice_point: 899100
  }
}
layer {
  name: "InnerProduct1"
  type: "InnerProduct"
  bottom: "Slice1"
  top: "InnerProduct1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU1"
  type: "ReLU"
  bottom: "InnerProduct1"
  top: "InnerProduct1"
}
layer {
  name: "InnerProduct2"
  type: "InnerProduct"
  bottom: "Slice2"
  top: "InnerProduct2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU2"
  type: "ReLU"
  bottom: "InnerProduct2"
  top: "InnerProduct2"
}
layer {
  name: "InnerProduct3"
  type: "InnerProduct"
  bottom: "Slice3"
  top: "InnerProduct3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU3"
  type: "ReLU"
  bottom: "InnerProduct3"
  top: "InnerProduct3"
}
layer {
  name: "InnerProduct4"
  type: "InnerProduct"
  bottom: "Slice4"
  top: "InnerProduct4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU4"
  type: "ReLU"
  bottom: "InnerProduct4"
  top: "InnerProduct4"
}
layer {
  name: "InnerProduct5"
  type: "InnerProduct"
  bottom: "Slice5"
  top: "InnerProduct5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU5"
  type: "ReLU"
  bottom: "InnerProduct5"
  top: "InnerProduct5"
}
layer {
  name: "InnerProduct6"
  type: "InnerProduct"
  bottom: "Slice6"
  top: "InnerProduct6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU6"
  type: "ReLU"
  bottom: "InnerProduct6"
  top: "InnerProduct6"
}
layer {
  name: "InnerProduct7"
  type: "InnerProduct"
  bottom: "Slice7"
  top: "InnerProduct7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU7"
  type: "ReLU"
  bottom: "InnerProduct7"
  top: "InnerProduct7"
}
layer {
  name: "InnerProduct8"
  type: "InnerProduct"
  bottom: "Slice8"
  top: "InnerProduct8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU8"
  type: "ReLU"
  bottom: "InnerProduct8"
  top: "InnerProduct8"
}
layer {
  name: "InnerProduct9"
  type: "InnerProduct"
  bottom: "Slice9"
  top: "InnerProduct9"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU9"
  type: "ReLU"
  bottom: "InnerProduct9"
  top: "InnerProduct9"
}
layer {
  name: "InnerProduct10"
  type: "InnerProduct"
  bottom: "Slice10"
  top: "InnerProduct10"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU10"
  type: "ReLU"
  bottom: "InnerProduct10"
  top: "InnerProduct10"
}
layer {
  name: "InnerProduct11"
  type: "InnerProduct"
  bottom: "Slice11"
  top: "InnerProduct11"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU11"
  type: "ReLU"
  bottom: "InnerProduct11"
  top: "InnerProduct11"
}
layer {
  name: "InnerProduct12"
  type: "InnerProduct"
  bottom: "Slice12"
  top: "InnerProduct12"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU12"
  type: "ReLU"
  bottom: "InnerProduct12"
  top: "InnerProduct12"
}
layer {
  name: "InnerProduct13"
  type: "InnerProduct"
  bottom: "Slice13"
  top: "InnerProduct13"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU13"
  type: "ReLU"
  bottom: "InnerProduct13"
  top: "InnerProduct13"
}
layer {
  name: "InnerProduct14"
  type: "InnerProduct"
  bottom: "Slice14"
  top: "InnerProduct14"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU14"
  type: "ReLU"
  bottom: "InnerProduct14"
  top: "InnerProduct14"
}
layer {
  name: "InnerProduct15"
  type: "InnerProduct"
  bottom: "Slice15"
  top: "InnerProduct15"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU15"
  type: "ReLU"
  bottom: "InnerProduct15"
  top: "InnerProduct15"
}
layer {
  name: "InnerProduct16"
  type: "InnerProduct"
  bottom: "Slice16"
  top: "InnerProduct16"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU16"
  type: "ReLU"
  bottom: "InnerProduct16"
  top: "InnerProduct16"
}
layer {
  name: "InnerProduct17"
  type: "InnerProduct"
  bottom: "Slice17"
  top: "InnerProduct17"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "gaussian"
      std: 0.0098765
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "ReLU17"
  type: "ReLU"
  bottom: "InnerProduct17"
  top: "InnerProduct17"
}
layer {
  name: "InnerProduct18"
  type: "InnerProduct"
  bottom: "Slice18"
