name: "Sauron Tree V0.11"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 227
    scale: 0.00390625
#    mean_file: "tfdp_mean.binaryproto"
  }
  data_param {
    source: "/datas/root/deepid_test/cacd_train_lmdb"
    batch_size: 256
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 227
    scale: 0.00390625
#    mean_file: "tfdp_mean.binaryproto"
  }
  data_param {
    source: "/datas/root/deepid_test/cacd_val_lmdb"
    batch_size: 4
    backend: LMDB
  }
}
layer {
  name: "slice_data"
  type: "Slice"
  bottom: "data"
  top: "data_r"
  top: "data_g"
  top: "data_b"
  slice_param {
    slice_dim: 1
    slice_point: 1
    slice_point: 2
  }
}
layer {
  name: "none0"
  type: "InnerProduct"
  bottom: "data_g"
  top: "none0"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "none1"
  type: "InnerProduct"
  bottom: "data_b"
  top: "none1"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss-none0"
  type: "SoftmaxWithLoss"
  bottom: "none0"
  bottom: "label"
  top: "loss-none0"
  loss_weight: 0
}
layer {
  name: "loss-none1"
  type: "SoftmaxWithLoss"
  bottom: "none1"
  bottom: "label"
  top: "loss-none1"
  loss_weight: 0
}
layer {
  name: "flat_data"
  type: "Flatten"
  bottom: "data_r"
  top: "flat_data"
}
#############################################33
layer {
  name: "slice_pair"
  type: "Slice"
  bottom: "flat_data"
    top: "data-0"
  top: "data-1"
  top: "data-2"
  top: "data-3"
  top: "data-4"
  top: "data-5"
  top: "data-6"
  top: "data-7"
  top: "data-8"
  top: "data-9"
  top: "data-10"
  top: "data-11"
  top: "data-12"
  top: "data-13"
  top: "data-14"
  top: "data-15"
  top: "data-16"
  top: "data-17"
  top: "data-18"
  top: "data-19"
  top: "data-20"
  top: "data-21"
  top: "data-22"
  top: "data-23"
  top: "data-24"
  top: "data-25"
  top: "data-26"
  top: "data-27"
  top: "data-28"
  top: "data-29"
  top: "data-30"
  top: "data-31"
  top: "data-32"
  top: "data-33"
  top: "data-34"
  top: "data-35"
  top: "data-36"
  top: "data-37"
  top: "data-38"
  top: "data-39"
  top: "data-40"
  top: "data-41"
  top: "data-42"
  top: "data-43"
  top: "data-44"
  top: "data-45"
  top: "data-46"
  top: "data-47"
  top: "data-48"
  top: "data-49"
  top: "data-50"
  top: "data-51"
  top: "data-52"
  top: "data-53"
  top: "data-54"
  top: "data-55"
  top: "data-56"
  top: "data-57"
  top: "data-58"
  top: "data-59"
  top: "data-60"
  top: "data-61"
  top: "data-62"
  top: "data-63"
  top: "data-64"
  top: "data-65"
  top: "data-66"
  top: "data-67"
  top: "data-68"
  top: "data-69"
  top: "data-70"
  top: "data-71"
  top: "data-72"
  top: "data-73"
  top: "data-74"
  top: "data-75"
  top: "data-76"
  top: "data-77"
  top: "data-78"
  top: "data-79"
  top: "data-80"
  top: "data-81"
  top: "data-82"
  top: "data-83"
  top: "data-84"
  top: "data-85"
  top: "data-86"
  top: "data-87"
  top: "data-88"
  top: "data-89"
  top: "data-90"
  top: "data-91"
  top: "data-92"
  top: "data-93"
  top: "data-94"
  top: "data-95"
  top: "data-96"
  top: "data-97"
  top: "data-98"
  top: "data-99"
  top: "data-100"
  top: "data-101"
  top: "data-102"
  top: "data-103"
  top: "data-104"
  top: "data-105"
  top: "data-106"
  top: "data-107"
  top: "data-108"
  top: "data-109"
  top: "data-110"
  top: "data-111"
  top: "data-112"
  top: "data-113"
  top: "data-114"
  top: "data-115"
  top: "data-116"
  top: "data-117"
  top: "data-118"
  top: "data-119"
  top: "data-120"
  top: "data-121"
  top: "data-122"
  top: "data-123"
  top: "data-124"
  top: "data-125"
  top: "data-126"
  top: "data-127"
  top: "data-128"
  top: "data-129"
  top: "data-130"
  top: "data-131"
  top: "data-132"
  top: "data-133"
  top: "data-134"
  top: "data-135"
  top: "data-136"
  top: "data-137"
  top: "data-138"
  top: "data-139"
  top: "data-140"
  top: "data-141"
  top: "data-142"
  top: "data-143"
  top: "data-144"
  top: "data-145"
  top: "data-146"
  top: "data-147"
  top: "data-148"
  top: "data-149"
  top: "data-150"
  top: "data-151"
  top: "data-152"
  top: "data-153"
  top: "data-154"
  top: "data-155"
  top: "data-156"
  top: "data-157"
  top: "data-158"
  top: "data-159"
  top: "data-160"
  top: "data-161"
  top: "data-162"
  top: "data-163"
  top: "data-164"
  top: "data-165"
  top: "data-166"
  top: "data-167"
  top: "data-168"
  top: "data-169"
  top: "data-170"
  top: "data-171"
  top: "data-172"
  top: "data-173"
  top: "data-174"
  top: "data-175"
  top: "data-176"
  top: "data-177"
  top: "data-178"
  top: "data-179"
  top: "data-180"
  top: "data-181"
  top: "data-182"
  top: "data-183"
  top: "data-184"
  top: "data-185"
  top: "data-186"
  top: "data-187"
  top: "data-188"
  top: "data-189"
  top: "data-190"
  top: "data-191"
  top: "data-192"
  top: "data-193"
  top: "data-194"
  top: "data-195"
  top: "data-196"
  top: "data-197"
  top: "data-198"
  top: "data-199"
  top: "data-200"
  top: "data-201"
  top: "data-202"
  top: "data-203"
  top: "data-204"
  top: "data-205"
  top: "data-206"
  top: "data-207"
  top: "data-208"
  top: "data-209"
  top: "data-210"
  top: "data-211"
  top: "data-212"
  top: "data-213"
  top: "data-214"
  top: "data-215"
  top: "data-216"
  top: "data-217"
  top: "data-218"
  top: "data-219"
  top: "data-220"
  top: "data-221"
  top: "data-222"
  top: "data-223"
  top: "data-224"
  top: "data-225"
  top: "data-226"
  top: "data-227"
  top: "data-228"
  top: "data-229"
  top: "data-230"
  top: "data-231"
  top: "data-232"
  top: "data-233"
  top: "data-234"
  top: "data-235"
  top: "data-236"
  top: "data-237"
  top: "data-238"
  top: "data-239"
  top: "data-240"
  top: "data-241"
  top: "data-242"
  top: "data-243"
  top: "data-244"
  top: "data-245"
  top: "data-246"
  top: "data-247"
  top: "data-248"
  top: "data-249"
  top: "data-250"
  top: "data-251"
  top: "data-252"
  top: "data-253"
  top: "data-254"
  top: "data-255"
  top: "data-256"
  top: "data-257"
  top: "data-258"
  top: "data-259"
  top: "data-260"
  top: "data-261"
  top: "data-262"
  top: "data-263"
  top: "data-264"
  top: "data-265"
  top: "data-266"
  top: "data-267"
  top: "data-268"
  top: "data-269"
  top: "data-270"
  top: "data-271"
  top: "data-272"
  top: "data-273"
  top: "data-274"
  top: "data-275"
  top: "data-276"
  top: "data-277"
  top: "data-278"
  top: "data-279"
  top: "data-280"
  top: "data-281"
  top: "data-282"
  top: "data-283"
  top: "data-284"
  top: "data-285"
  top: "data-286"
  top: "data-287"
  top: "data-288"
  top: "data-289"
  top: "data-290"
  top: "data-291"
  top: "data-292"
  top: "data-293"
  top: "data-294"
  top: "data-295"
  top: "data-296"
  top: "data-297"
  top: "data-298"
  top: "data-299"
  top: "data-300"
  top: "data-301"
  top: "data-302"
  top: "data-303"
  top: "data-304"
  top: "data-305"
  top: "data-306"
  top: "data-307"
  top: "data-308"
  top: "data-309"
  top: "data-310"
  top: "data-311"
  top: "data-312"
  top: "data-313"
  top: "data-314"
  top: "data-315"
  top: "data-316"
  top: "data-317"
  top: "data-318"
  top: "data-319"
  top: "data-320"
  top: "data-321"
  top: "data-322"
  top: "data-323"
  top: "data-324"
  top: "data-325"
  top: "data-326"
  top: "data-327"
  top: "data-328"
  top: "data-329"
  top: "data-330"
  top: "data-331"
  top: "data-332"
  top: "data-333"
  top: "data-334"
  top: "data-335"
  top: "data-336"
  top: "data-337"
  top: "data-338"
  top: "data-339"
  top: "data-340"
  top: "data-341"
  top: "data-342"
  top: "data-343"
  top: "data-344"
  top: "data-345"
  top: "data-346"
  top: "data-347"
  top: "data-348"
  top: "data-349"
  top: "data-350"
  top: "data-351"
  top: "data-352"
  top: "data-353"
  top: "data-354"
  top: "data-355"
  top: "data-356"
  top: "data-357"
  top: "data-358"
  top: "data-359"
  top: "data-360"
  top: "data-361"
  top: "data-362"
  top: "data-363"
  top: "data-364"
  top: "data-365"
  top: "data-366"
  top: "data-367"
  top: "data-368"
  top: "data-369"
  top: "data-370"
  top: "data-371"
  top: "data-372"
  top: "data-373"
  top: "data-374"
  top: "data-375"
  top: "data-376"
  top: "data-377"
  top: "data-378"
  top: "data-379"
  top: "data-380"
  top: "data-381"
  top: "data-382"
  top: "data-383"
  top: "data-384"
  top: "data-385"
  top: "data-386"
  top: "data-387"
  top: "data-388"
  top: "data-389"
  top: "data-390"
  top: "data-391"
  top: "data-392"
  top: "data-393"
  top: "data-394"
  top: "data-395"
  top: "data-396"
  top: "data-397"
  top: "data-398"
  top: "data-399"
  top: "data-400"
  top: "data-401"
  top: "data-402"
  top: "data-403"
  top: "data-404"
  top: "data-405"
  top: "data-406"
  top: "data-407"
  top: "data-408"
  top: "data-409"
  top: "data-410"
  top: "data-411"
  top: "data-412"
  top: "data-413"
  top: "data-414"
  top: "data-415"
  top: "data-416"
  top: "data-417"
  top: "data-418"
  top: "data-419"
  top: "data-420"
  top: "data-421"
  top: "data-422"
  top: "data-423"
  top: "data-424"
  top: "data-425"
  top: "data-426"
  top: "data-427"
  top: "data-428"
  top: "data-429"
  top: "data-430"
  top: "data-431"
  top: "data-432"
  top: "data-433"
  top: "data-434"
  top: "data-435"
  top: "data-436"
  top: "data-437"
  top: "data-438"
  top: "data-439"
  top: "data-440"
  top: "data-441"
  top: "data-442"
  top: "data-443"
  top: "data-444"
  top: "data-445"
  top: "data-446"
  top: "data-447"
  top: "data-448"
  top: "data-449"
  top: "data-450"
  top: "data-451"
  top: "data-452"
  top: "data-453"
  top: "data-454"
  top: "data-455"
  top: "data-456"
  top: "data-457"
  top: "data-458"
  top: "data-459"
  top: "data-460"
  top: "data-461"
  top: "data-462"
  top: "data-463"
  top: "data-464"
  top: "data-465"
  top: "data-466"
  top: "data-467"
  top: "data-468"
  top: "data-469"
  top: "data-470"
  top: "data-471"
  top: "data-472"
  top: "data-473"
  top: "data-474"
  top: "data-475"
  top: "data-476"
  top: "data-477"
  top: "data-478"
  top: "data-479"
  top: "data-480"
  top: "data-481"
  top: "data-482"
  top: "data-483"
  top: "data-484"
  top: "data-485"
  top: "data-486"
  top: "data-487"
  top: "data-488"
  top: "data-489"
  top: "data-490"
  top: "data-491"
  top: "data-492"
  top: "data-493"
  top: "data-494"
  top: "data-495"
  top: "data-496"
  top: "data-497"
  top: "data-498"
  top: "data-499"
  top: "data-500"
  top: "data-501"
  top: "data-502"
  top: "data-503"
  top: "data-504"
  top: "data-505"
  top: "data-506"
  top: "data-507"
  top: "data-508"
  top: "data-509"
  top: "data-510"
  top: "data-511"
  top: "data-512"
  top: "data-513"
  top: "data-514"
  top: "data-515"
  top: "data-516"
  top: "data-517"
  top: "data-518"
  top: "data-519"
  top: "data-520"
  top: "data-521"
  top: "data-522"
  top: "data-523"
  top: "data-524"
  top: "data-525"
  top: "data-526"
  top: "data-527"
  top: "data-528"
  top: "data-529"
  top: "data-530"
  top: "data-531"
  top: "data-532"
  top: "data-533"
  top: "data-534"
  top: "data-535"
  top: "data-536"
  top: "data-537"
  top: "data-538"
  top: "data-539"
  top: "data-540"
  top: "data-541"
  top: "data-542"
  top: "data-543"
  top: "data-544"
  top: "data-545"
  top: "data-546"
  top: "data-547"
  top: "data-548"
  top: "data-549"
  top: "data-550"
  top: "data-551"
  top: "data-552"
  top: "data-553"
  top: "data-554"
  top: "data-555"
  top: "data-556"
  top: "data-557"
  top: "data-558"
  top: "data-559"
  top: "data-560"
  top: "data-561"
  top: "data-562"
  top: "data-563"
  top: "data-564"
  top: "data-565"
  top: "data-566"
  top: "data-567"
  top: "data-568"
  top: "data-569"
  top: "data-570"
  top: "data-571"
  top: "data-572"
  top: "data-573"
  top: "data-574"
  top: "data-575"
  top: "data-576"
  top: "data-577"
  top: "data-578"
  top: "data-579"
  top: "data-580"
  top: "data-581"
  top: "data-582"
  top: "data-583"
  top: "data-584"
  top: "data-585"
  top: "data-586"
  top: "data-587"
  top: "data-588"
  top: "data-589"
  top: "data-590"
  top: "data-591"
  top: "data-592"
  top: "data-593"
  top: "data-594"
  top: "data-595"
  top: "data-596"
  top: "data-597"
  top: "data-598"
  top: "data-599"
  top: "data-600"
  top: "data-601"
  top: "data-602"
  top: "data-603"
  top: "data-604"
  top: "data-605"
  top: "data-606"
  top: "data-607"
  top: "data-608"
  top: "data-609"
  top: "data-610"
  top: "data-611"
  top: "data-612"
  top: "data-613"
  top: "data-614"
  top: "data-615"
  top: "data-616"
  top: "data-617"
  top: "data-618"
  top: "data-619"
  top: "data-620"
  top: "data-621"
  top: "data-622"
  top: "data-623"
  top: "data-624"
  top: "data-625"
  top: "data-626"
  top: "data-627"
  top: "data-628"
  top: "data-629"
  top: "data-630"
  top: "data-631"
  top: "data-632"
  top: "data-633"
  top: "data-634"
  top: "data-635"
  top: "data-636"
  top: "data-637"
  top: "data-638"
  top: "data-639"
  top: "data-640"
  top: "data-641"
  top: "data-642"
  top: "data-643"
  top: "data-644"
  top: "data-645"
  top: "data-646"
  top: "data-647"
  top: "data-648"
  top: "data-649"
  top: "data-650"
  top: "data-651"
  top: "data-652"
  top: "data-653"
  top: "data-654"
  top: "data-655"
  top: "data-656"
  top: "data-657"
  top: "data-658"
  top: "data-659"
  top: "data-660"
  top: "data-661"
  top: "data-662"
  top: "data-663"
  top: "data-664"
  top: "data-665"
  top: "data-666"
  top: "data-667"
  top: "data-668"
  top: "data-669"
  top: "data-670"
  top: "data-671"
  top: "data-672"
  top: "data-673"
  top: "data-674"
  top: "data-675"
  top: "data-676"
  top: "data-677"
  top: "data-678"
  top: "data-679"
  top: "data-680"
  top: "data-681"
  top: "data-682"
  top: "data-683"
  top: "data-684"
  top: "data-685"
  top: "data-686"
  top: "data-687"
  top: "data-688"
  top: "data-689"
  top: "data-690"
  top: "data-691"
  top: "data-692"
  top: "data-693"
  top: "data-694"
  top: "data-695"
  top: "data-696"
  top: "data-697"
  top: "data-698"
  top: "data-699"
  top: "data-700"
  top: "data-701"
  top: "data-702"
  top: "data-703"
  top: "data-704"
  top: "data-705"
  top: "data-706"
  top: "data-707"
  top: "data-708"
  top: "data-709"
  top: "data-710"
  top: "data-711"
  top: "data-712"
  top: "data-713"
  top: "data-714"
  top: "data-715"
  top: "data-716"
  top: "data-717"
  top: "data-718"
  top: "data-719"
  top: "data-720"
  top: "data-721"
  top: "data-722"
  top: "data-723"
  top: "data-724"
  top: "data-725"
  top: "data-726"
  top: "data-727"
  top: "data-728"
  top: "data-729"
  top: "data-730"
  top: "data-731"
  top: "data-732"
  top: "data-733"
  top: "data-734"
  top: "data-735"
  top: "data-736"
  top: "data-737"
  top: "data-738"
  top: "data-739"
  top: "data-740"
  top: "data-741"
  top: "data-742"
  top: "data-743"
  top: "data-744"
  top: "data-745"
  top: "data-746"
  top: "data-747"
  top: "data-748"
  top: "data-749"
  top: "data-750"
  top: "data-751"
  top: "data-752"
  top: "data-753"
  top: "data-754"
  top: "data-755"
  top: "data-756"
  top: "data-757"
  top: "data-758"
  top: "data-759"
  top: "data-760"
  top: "data-761"
  top: "data-762"
  top: "data-763"
  top: "data-764"
  top: "data-765"
  top: "data-766"
  top: "data-767"
  top: "data-768"
  top: "data-769"
  top: "data-770"
  top: "data-771"
  top: "data-772"
  top: "data-773"
  top: "data-774"
  top: "data-775"
  top: "data-776"
  top: "data-777"
  top: "data-778"
  top: "data-779"
  top: "data-780"
  top: "data-781"
  top: "data-782"
  top: "data-783"
  top: "data-784"
  top: "data-785"
  top: "data-786"
  top: "data-787"
  top: "data-788"
  top: "data-789"
  top: "data-790"
  top: "data-791"
  top: "data-792"
  top: "data-793"
  top: "data-794"
  top: "data-795"
  top: "data-796"
  top: "data-797"
  top: "data-798"
  top: "data-799"
  top: "data-800"
  top: "data-801"
  top: "data-802"
  top: "data-803"
  top: "data-804"
  top: "data-805"
  top: "data-806"
  top: "data-807"
  top: "data-808"
  top: "data-809"
  top: "data-810"
  top: "data-811"
  top: "data-812"
  top: "data-813"
  top: "data-814"
  top: "data-815"
  top: "data-816"
  top: "data-817"
  top: "data-818"
  top: "data-819"
  top: "data-820"
  top: "data-821"
  top: "data-822"
  top: "data-823"
  top: "data-824"
  top: "data-825"
  top: "data-826"
  top: "data-827"
  top: "data-828"
  top: "data-829"
  top: "data-830"
  top: "data-831"
  top: "data-832"
  top: "data-833"
  top: "data-834"
  top: "data-835"
  top: "data-836"
  top: "data-837"
  top: "data-838"
  top: "data-839"
  top: "data-840"
  top: "data-841"
  top: "data-842"
  top: "data-843"
  top: "data-844"
  top: "data-845"
  top: "data-846"
  top: "data-847"
  top: "data-848"
  top: "data-849"
  top: "data-850"
  top: "data-851"
  top: "data-852"
  top: "data-853"
  top: "data-854"
  top: "data-855"
  top: "data-856"
  top: "data-857"
  top: "data-858"
  top: "data-859"
  top: "data-860"
  top: "data-861"
  top: "data-862"
  top: "data-863"
  top: "data-864"
  top: "data-865"
  top: "data-866"
  top: "data-867"
  top: "data-868"
  top: "data-869"
  top: "data-870"
  top: "data-871"
  top: "data-872"
  top: "data-873"
  top: "data-874"
  top: "data-875"
  top: "data-876"
  top: "data-877"
  top: "data-878"
  top: "data-879"
  top: "data-880"
  top: "data-881"
  top: "data-882"
  top: "data-883"
  top: "data-884"
  top: "data-885"
  top: "data-886"
  top: "data-887"
  top: "data-888"
  top: "data-889"
  top: "data-890"
  top: "data-891"
  top: "data-892"
  top: "data-893"
  top: "data-894"
  top: "data-895"
  top: "data-896"
  top: "data-897"
  top: "data-898"
  top: "data-899"
  top: "data-900"
  top: "data-901"
  top: "data-902"
  top: "data-903"
  top: "data-904"
  top: "data-905"
  top: "data-906"
  top: "data-907"
  top: "data-908"
  top: "data-909"
  top: "data-910"
  top: "data-911"
  top: "data-912"
  top: "data-913"
  top: "data-914"
  top: "data-915"
  top: "data-916"
  top: "data-917"
  top: "data-918"
  top: "data-919"
  top: "data-920"
  top: "data-921"
  top: "data-922"
  top: "data-923"
  top: "data-924"
  top: "data-925"
  top: "data-926"
  top: "data-927"
  top: "data-928"
  top: "data-929"
  top: "data-930"
  top: "data-931"
  top: "data-932"
  top: "data-933"
  top: "data-934"
  top: "data-935"
  top: "data-936"
  top: "data-937"
  top: "data-938"
  top: "data-939"
  top: "data-940"
  top: "data-941"
  top: "data-942"
  top: "data-943"
  top: "data-944"
  top: "data-945"
  top: "data-946"
  top: "data-947"
  top: "data-948"
  top: "data-949"
  top: "data-950"
  top: "data-951"
  top: "data-952"
  top: "data-953"
  top: "data-954"
  top: "data-955"
  top: "data-956"
  top: "data-957"
  top: "data-958"
  top: "data-959"
  top: "data-960"
  top: "data-961"
  top: "data-962"
  top: "data-963"
  top: "data-964"
  top: "data-965"
  top: "data-966"
  top: "data-967"
  top: "data-968"
  top: "data-969"
  top: "data-970"
  top: "data-971"
  top: "data-972"
  top: "data-973"
  top: "data-974"
  top: "data-975"
  top: "data-976"
  top: "data-977"
  top: "data-978"
  top: "data-979"
  top: "data-980"
  top: "data-981"
  top: "data-982"
  top: "data-983"
  top: "data-984"
  top: "data-985"
  top: "data-986"
  top: "data-987"
  top: "data-988"
  top: "data-989"
  top: "data-990"
  top: "data-991"
  top: "data-992"
  top: "data-993"
  top: "data-994"
  top: "data-995"
  top: "data-996"
  top: "data-997"
  top: "data-998"
  top: "data-999"

  slice_param {
    slice_dim: 1
        slice_point: 51
    slice_point: 102
    slice_point: 153
    slice_point: 204
    slice_point: 255
    slice_point: 306
    slice_point: 357
    slice_point: 408
    slice_point: 459
    slice_point: 510
    slice_point: 561
    slice_point: 612
    slice_point: 663
    slice_point: 714
    slice_point: 765
    slice_point: 816
    slice_point: 867
    slice_point: 918
    slice_point: 969
    slice_point: 1020
    slice_point: 1071
    slice_point: 1122
    slice_point: 1173
    slice_point: 1224
    slice_point: 1275
    slice_point: 1326
    slice_point: 1377
    slice_point: 1428
    slice_point: 1479
    slice_point: 1530
    slice_point: 1581
    slice_point: 1632
    slice_point: 1683
    slice_point: 1734
    slice_point: 1785
    slice_point: 1836
    slice_point: 1887
    slice_point: 1938
    slice_point: 1989
    slice_point: 2040
    slice_point: 2091
    slice_point: 2142
    slice_point: 2193
    slice_point: 2244
    slice_point: 2295
    slice_point: 2346
    slice_point: 2397
    slice_point: 2448
    slice_point: 2499
    slice_point: 2550
    slice_point: 2601
    slice_point: 2652
    slice_point: 2703
    slice_point: 2754
    slice_point: 2805
    slice_point: 2856
    slice_point: 2907
    slice_point: 2958
    slice_point: 3009
    slice_point: 3060
    slice_point: 3111
    slice_point: 3162
    slice_point: 3213
    slice_point: 3264
    slice_point: 3315
    slice_point: 3366
    slice_point: 3417
    slice_point: 3468
    slice_point: 3519
    slice_point: 3570
    slice_point: 3621
    slice_point: 3672
    slice_point: 3723
    slice_point: 3774
    slice_point: 3825
    slice_point: 3876
    slice_point: 3927
    slice_point: 3978
    slice_point: 4029
    slice_point: 4080
    slice_point: 4131
    slice_point: 4182
    slice_point: 4233
    slice_point: 4284
    slice_point: 4335
    slice_point: 4386
    slice_point: 4437
    slice_point: 4488
    slice_point: 4539
    slice_point: 4590
    slice_point: 4641
    slice_point: 4692
    slice_point: 4743
    slice_point: 4794
    slice_point: 4845
    slice_point: 4896
    slice_point: 4947
    slice_point: 4998
    slice_point: 5049
    slice_point: 5100
    slice_point: 5151
    slice_point: 5202
    slice_point: 5253
    slice_point: 5304
    slice_point: 5355
    slice_point: 5406
    slice_point: 5457
    slice_point: 5508
    slice_point: 5559
    slice_point: 5610
    slice_point: 5661
    slice_point: 5712
    slice_point: 5763
    slice_point: 5814
    slice_point: 5865
    slice_point: 5916
    slice_point: 5967
    slice_point: 6018
    slice_point: 6069
    slice_point: 6120
    slice_point: 6171
    slice_point: 6222
    slice_point: 6273
    slice_point: 6324
    slice_point: 6375
    slice_point: 6426
    slice_point: 6477
    slice_point: 6528
    slice_point: 6579
    slice_point: 6630
    slice_point: 6681
    slice_point: 6732
    slice_point: 6783
    slice_point: 6834
    slice_point: 6885
    slice_point: 6936
    slice_point: 6987
    slice_point: 7038
    slice_point: 7089
    slice_point: 7140
    slice_point: 7191
    slice_point: 7242
    slice_point: 7293
    slice_point: 7344
    slice_point: 7395
    slice_point: 7446
    slice_point: 7497
    slice_point: 7548
    slice_point: 7599
    slice_point: 7650
    slice_point: 7701
    slice_point: 7752
    slice_point: 7803
    slice_point: 7854
    slice_point: 7905
    slice_point: 7956
    slice_point: 8007
    slice_point: 8058
    slice_point: 8109
    slice_point: 8160
    slice_point: 8211
    slice_point: 8262
    slice_point: 8313
    slice_point: 8364
    slice_point: 8415
    slice_point: 8466
    slice_point: 8517
    slice_point: 8568
    slice_point: 8619
    slice_point: 8670
    slice_point: 8721
    slice_point: 8772
    slice_point: 8823
    slice_point: 8874
    slice_point: 8925
    slice_point: 8976
    slice_point: 9027
    slice_point: 9078
    slice_point: 9129
    slice_point: 9180
    slice_point: 9231
    slice_point: 9282
    slice_point: 9333
    slice_point: 9384
    slice_point: 9435
    slice_point: 9486
    slice_point: 9537
    slice_point: 9588
    slice_point: 9639
    slice_point: 9690
    slice_point: 9741
    slice_point: 9792
    slice_point: 9843
    slice_point: 9894
    slice_point: 9945
    slice_point: 9996
    slice_point: 10047
    slice_point: 10098
    slice_point: 10149
    slice_point: 10200
    slice_point: 10251
    slice_point: 10302
    slice_point: 10353
    slice_point: 10404
    slice_point: 10455
    slice_point: 10506
    slice_point: 10557
    slice_point: 10608
    slice_point: 10659
    slice_point: 10710
    slice_point: 10761
    slice_point: 10812
    slice_point: 10863
    slice_point: 10914
    slice_point: 10965
    slice_point: 11016
    slice_point: 11067
    slice_point: 11118
    slice_point: 11169
    slice_point: 11220
    slice_point: 11271
    slice_point: 11322
    slice_point: 11373
    slice_point: 11424
    slice_point: 11475
    slice_point: 11526
    slice_point: 11577
    slice_point: 11628
    slice_point: 11679
    slice_point: 11730
    slice_point: 11781
    slice_point: 11832
    slice_point: 11883
    slice_point: 11934
    slice_point: 11985
    slice_point: 12036
    slice_point: 12087
    slice_point: 12138
    slice_point: 12189
    slice_point: 12240
    slice_point: 12291
    slice_point: 12342
    slice_point: 12393
    slice_point: 12444
    slice_point: 12495
    slice_point: 12546
    slice_point: 12597
    slice_point: 12648
    slice_point: 12699
    slice_point: 12750
    slice_point: 12801
    slice_point: 12852
    slice_point: 12903
    slice_point: 12954
    slice_point: 13005
    slice_point: 13056
    slice_point: 13107
    slice_point: 13158
    slice_point: 13209
    slice_point: 13260
    slice_point: 13311
    slice_point: 13362
    slice_point: 13413
    slice_point: 13464
    slice_point: 13515
    slice_point: 13566
    slice_point: 13617
    slice_point: 13668
    slice_point: 13719
    slice_point: 13770
    slice_point: 13821
    slice_point: 13872
    slice_point: 13923
    slice_point: 13974
    slice_point: 14025
    slice_point: 14076
    slice_point: 14127
    slice_point: 14178
    slice_point: 14229
    slice_point: 14280
    slice_point: 14331
    slice_point: 14382
    slice_point: 14433
    slice_point: 14484
    slice_point: 14535
    slice_point: 14586
    slice_point: 14637
    slice_point: 14688
    slice_point: 14739
    slice_point: 14790
    slice_point: 14841
    slice_point: 14892
    slice_point: 14943
    slice_point: 14994
    slice_point: 15045
    slice_point: 15096
    slice_point: 15147
    slice_point: 15198
    slice_point: 15249
    slice_point: 15300
    slice_point: 15351
    slice_point: 15402
    slice_point: 15453
    slice_point: 15504
    slice_point: 15555
    slice_point: 15606
    slice_point: 15657
    slice_point: 15708
    slice_point: 15759
    slice_point: 15810
    slice_point: 15861
    slice_point: 15912
    slice_point: 15963
    slice_point: 16014
    slice_point: 16065
    slice_point: 16116
    slice_point: 16167
    slice_point: 16218
    slice_point: 16269
    slice_point: 16320
    slice_point: 16371
    slice_point: 16422
    slice_point: 16473
    slice_point: 16524
    slice_point: 16575
    slice_point: 16626
    slice_point: 16677
    slice_point: 16728
    slice_point: 16779
    slice_point: 16830
    slice_point: 16881
    slice_point: 16932
    slice_point: 16983
    slice_point: 17034
    slice_point: 17085
    slice_point: 17136
    slice_point: 17187
    slice_point: 17238
    slice_point: 17289
    slice_point: 17340
    slice_point: 17391
    slice_point: 17442
    slice_point: 17493
    slice_point: 17544
    slice_point: 17595
    slice_point: 17646
    slice_point: 17697
    slice_point: 17748
    slice_point: 17799
    slice_point: 17850
    slice_point: 17901
    slice_point: 17952
    slice_point: 18003
    slice_point: 18054
    slice_point: 18105
    slice_point: 18156
    slice_point: 18207
    slice_point: 18258
    slice_point: 18309
    slice_point: 18360
    slice_point: 18411
    slice_point: 18462
    slice_point: 18513
    slice_point: 18564
    slice_point: 18615
    slice_point: 18666
    slice_point: 18717
    slice_point: 18768
    slice_point: 18819
    slice_point: 18870
    slice_point: 18921
    slice_point: 18972
    slice_point: 19023
    slice_point: 19074
    slice_point: 19125
    slice_point: 19176
    slice_point: 19227
    slice_point: 19278
    slice_point: 19329
    slice_point: 19380
    slice_point: 19431
    slice_point: 19482
    slice_point: 19533
    slice_point: 19584
    slice_point: 19635
    slice_point: 19686
    slice_point: 19737
    slice_point: 19788
    slice_point: 19839
    slice_point: 19890
    slice_point: 19941
    slice_point: 19992
    slice_point: 20043
    slice_point: 20094
    slice_point: 20145
    slice_point: 20196
    slice_point: 20247
    slice_point: 20298
    slice_point: 20349
    slice_point: 20400
    slice_point: 20451
    slice_point: 20502
    slice_point: 20553
    slice_point: 20604
    slice_point: 20655
    slice_point: 20706
    slice_point: 20757
    slice_point: 20808
    slice_point: 20859
    slice_point: 20910
    slice_point: 20961
    slice_point: 21012
    slice_point: 21063
    slice_point: 21114
    slice_point: 21165
    slice_point: 21216
    slice_point: 21267
    slice_point: 21318
    slice_point: 21369
    slice_point: 21420
    slice_point: 21471
    slice_point: 21522
    slice_point: 21573
    slice_point: 21624
    slice_point: 21675
    slice_point: 21726
    slice_point: 21777
    slice_point: 21828
    slice_point: 21879
    slice_point: 21930
    slice_point: 21981
    slice_point: 22032
    slice_point: 22083
    slice_point: 22134
    slice_point: 22185
    slice_point: 22236
    slice_point: 22287
    slice_point: 22338
    slice_point: 22389
    slice_point: 22440
    slice_point: 22491
    slice_point: 22542
    slice_point: 22593
    slice_point: 22644
    slice_point: 22695
    slice_point: 22746
    slice_point: 22797
    slice_point: 22848
    slice_point: 22899
    slice_point: 22950
    slice_point: 23001
    slice_point: 23052
    slice_point: 23103
    slice_point: 23154
    slice_point: 23205
    slice_point: 23256
    slice_point: 23307
    slice_point: 23358
    slice_point: 23409
    slice_point: 23460
    slice_point: 23511
    slice_point: 23562
    slice_point: 23613
    slice_point: 23664
    slice_point: 23715
    slice_point: 23766
    slice_point: 23817
    slice_point: 23868
    slice_point: 23919
    slice_point: 23970
    slice_point: 24021
    slice_point: 24072
    slice_point: 24123
    slice_point: 24174
    slice_point: 24225
    slice_point: 24276
    slice_point: 24327
    slice_point: 24378
    slice_point: 24429
    slice_point: 24480
    slice_point: 24531
    slice_point: 24582
    slice_point: 24633
    slice_point: 24684
    slice_point: 24735
    slice_point: 24786
    slice_point: 24837
    slice_point: 24888
    slice_point: 24939
    slice_point: 24990
    slice_point: 25041
    slice_point: 25092
    slice_point: 25143
    slice_point: 25194
    slice_point: 25245
    slice_point: 25296
    slice_point: 25347
    slice_point: 25398
    slice_point: 25449
    slice_point: 25500
    slice_point: 25551
    slice_point: 25602
    slice_point: 25653
    slice_point: 25704
    slice_point: 25755
    slice_point: 25806
    slice_point: 25857
    slice_point: 25908
    slice_point: 25959
    slice_point: 26010
    slice_point: 26061
    slice_point: 26112
    slice_point: 26163
    slice_point: 26214
    slice_point: 26265
    slice_point: 26316
    slice_point: 26367
    slice_point: 26418
    slice_point: 26469
    slice_point: 26520
    slice_point: 26571
    slice_point: 26622
    slice_point: 26673
    slice_point: 26724
    slice_point: 26775
    slice_point: 26826
    slice_point: 26877
    slice_point: 26928
    slice_point: 26979
    slice_point: 27030
    slice_point: 27081
    slice_point: 27132
    slice_point: 27183
    slice_point: 27234
    slice_point: 27285
    slice_point: 27336
    slice_point: 27387
    slice_point: 27438
    slice_point: 27489
    slice_point: 27540
    slice_point: 27591
    slice_point: 27642
    slice_point: 27693
    slice_point: 27744
    slice_point: 27795
    slice_point: 27846
    slice_point: 27897
    slice_point: 27948
    slice_point: 27999
    slice_point: 28050
    slice_point: 28101
    slice_point: 28152
    slice_point: 28203
    slice_point: 28254
    slice_point: 28305
    slice_point: 28356
    slice_point: 28407
    slice_point: 28458
    slice_point: 28509
    slice_point: 28560
    slice_point: 28611
    slice_point: 28662
    slice_point: 28713
    slice_point: 28764
    slice_point: 28815
    slice_point: 28866
    slice_point: 28917
    slice_point: 28968
    slice_point: 29019
    slice_point: 29070
    slice_point: 29121
    slice_point: 29172
    slice_point: 29223
    slice_point: 29274
    slice_point: 29325
    slice_point: 29376
    slice_point: 29427
    slice_point: 29478
    slice_point: 29529
    slice_point: 29580
    slice_point: 29631
    slice_point: 29682
    slice_point: 29733
    slice_point: 29784
    slice_point: 29835
    slice_point: 29886
    slice_point: 29937
    slice_point: 29988
    slice_point: 30039
    slice_point: 30090
    slice_point: 30141
    slice_point: 30192
    slice_point: 30243
    slice_point: 30294
    slice_point: 30345
    slice_point: 30396
    slice_point: 30447
    slice_point: 30498
    slice_point: 30549
    slice_point: 30600
    slice_point: 30651
    slice_point: 30702
    slice_point: 30753
    slice_point: 30804
    slice_point: 30855
    slice_point: 30906
    slice_point: 30957
    slice_point: 31008
    slice_point: 31059
    slice_point: 31110
    slice_point: 31161
    slice_point: 31212
    slice_point: 31263
    slice_point: 31314
    slice_point: 31365
    slice_point: 31416
    slice_point: 31467
    slice_point: 31518
    slice_point: 31569
    slice_point: 31620
    slice_point: 31671
    slice_point: 31722
    slice_point: 31773
    slice_point: 31824
    slice_point: 31875
    slice_point: 31926
    slice_point: 31977
    slice_point: 32028
    slice_point: 32079
    slice_point: 32130
    slice_point: 32181
    slice_point: 32232
    slice_point: 32283
    slice_point: 32334
    slice_point: 32385
    slice_point: 32436
    slice_point: 32487
    slice_point: 32538
    slice_point: 32589
    slice_point: 32640
    slice_point: 32691
    slice_point: 32742
    slice_point: 32793
    slice_point: 32844
    slice_point: 32895
    slice_point: 32946
    slice_point: 32997
    slice_point: 33048
    slice_point: 33099
    slice_point: 33150
    slice_point: 33201
    slice_point: 33252
    slice_point: 33303
    slice_point: 33354
    slice_point: 33405
    slice_point: 33456
    slice_point: 33507
    slice_point: 33558
    slice_point: 33609
    slice_point: 33660
    slice_point: 33711
    slice_point: 33762
    slice_point: 33813
    slice_point: 33864
    slice_point: 33915
    slice_point: 33966
    slice_point: 34017
    slice_point: 34068
    slice_point: 34119
    slice_point: 34170
    slice_point: 34221
    slice_point: 34272
    slice_point: 34323
    slice_point: 34374
    slice_point: 34425
    slice_point: 34476
    slice_point: 34527
    slice_point: 34578
    slice_point: 34629
    slice_point: 34680
    slice_point: 34731
    slice_point: 34782
    slice_point: 34833
    slice_point: 34884
    slice_point: 34935
    slice_point: 34986
    slice_point: 35037
    slice_point: 35088
    slice_point: 35139
    slice_point: 35190
    slice_point: 35241
    slice_point: 35292
    slice_point: 35343
    slice_point: 35394
    slice_point: 35445
    slice_point: 35496
    slice_point: 35547
    slice_point: 35598
    slice_point: 35649
    slice_point: 35700
    slice_point: 35751
    slice_point: 35802
    slice_point: 35853
    slice_point: 35904
    slice_point: 35955
    slice_point: 36006
    slice_point: 36057
    slice_point: 36108
    slice_point: 36159
    slice_point: 36210
    slice_point: 36261
    slice_point: 36312
    slice_point: 36363
    slice_point: 36414
    slice_point: 36465
    slice_point: 36516
    slice_point: 36567
    slice_point: 36618
    slice_point: 36669
    slice_point: 36720
    slice_point: 36771
    slice_point: 36822
    slice_point: 36873
    slice_point: 36924
    slice_point: 36975
    slice_point: 37026
    slice_point: 37077
    slice_point: 37128
    slice_point: 37179
    slice_point: 37230
    slice_point: 37281
    slice_point: 37332
    slice_point: 37383
    slice_point: 37434
    slice_point: 37485
    slice_point: 37536
    slice_point: 37587
    slice_point: 37638
    slice_point: 37689
    slice_point: 37740
    slice_point: 37791
    slice_point: 37842
    slice_point: 37893
    slice_point: 37944
    slice_point: 37995
    slice_point: 38046
    slice_point: 38097
    slice_point: 38148
    slice_point: 38199
    slice_point: 38250
    slice_point: 38301
    slice_point: 38352
    slice_point: 38403
    slice_point: 38454
    slice_point: 38505
    slice_point: 38556
    slice_point: 38607
    slice_point: 38658
    slice_point: 38709
    slice_point: 38760
    slice_point: 38811
    slice_point: 38862
    slice_point: 38913
    slice_point: 38964
    slice_point: 39015
    slice_point: 39066
    slice_point: 39117
    slice_point: 39168
    slice_point: 39219
    slice_point: 39270
    slice_point: 39321
    slice_point: 39372
    slice_point: 39423
    slice_point: 39474
    slice_point: 39525
    slice_point: 39576
    slice_point: 39627
    slice_point: 39678
    slice_point: 39729
    slice_point: 39780
    slice_point: 39831
    slice_point: 39882
    slice_point: 39933
    slice_point: 39984
    slice_point: 40035
    slice_point: 40086
    slice_point: 40137
    slice_point: 40188
    slice_point: 40239
    slice_point: 40290
    slice_point: 40341
    slice_point: 40392
    slice_point: 40443
    slice_point: 40494
    slice_point: 40545
    slice_point: 40596
    slice_point: 40647
    slice_point: 40698
    slice_point: 40749
    slice_point: 40800
    slice_point: 40851
    slice_point: 40902
    slice_point: 40953
    slice_point: 41004
    slice_point: 41055
    slice_point: 41106
    slice_point: 41157
    slice_point: 41208
    slice_point: 41259
    slice_point: 41310
    slice_point: 41361
    slice_point: 41412
    slice_point: 41463
    slice_point: 41514
    slice_point: 41565
    slice_point: 41616
    slice_point: 41667
    slice_point: 41718
    slice_point: 41769
    slice_point: 41820
    slice_point: 41871
    slice_point: 41922
    slice_point: 41973
    slice_point: 42024
    slice_point: 42075
    slice_point: 42126
    slice_point: 42177
    slice_point: 42228
    slice_point: 42279
    slice_point: 42330
    slice_point: 42381
    slice_point: 42432
    slice_point: 42483
    slice_point: 42534
    slice_point: 42585
    slice_point: 42636
    slice_point: 42687
    slice_point: 42738
    slice_point: 42789
    slice_point: 42840
    slice_point: 42891
    slice_point: 42942
    slice_point: 42993
    slice_point: 43044
    slice_point: 43095
    slice_point: 43146
    slice_point: 43197
    slice_point: 43248
    slice_point: 43299
    slice_point: 43350
    slice_point: 43401
    slice_point: 43452
    slice_point: 43503
    slice_point: 43554
    slice_point: 43605
    slice_point: 43656
    slice_point: 43707
    slice_point: 43758
    slice_point: 43809
    slice_point: 43860
    slice_point: 43911
    slice_point: 43962
    slice_point: 44013
    slice_point: 44064
    slice_point: 44115
    slice_point: 44166
    slice_point: 44217
    slice_point: 44268
    slice_point: 44319
    slice_point: 44370
    slice_point: 44421
    slice_point: 44472
    slice_point: 44523
    slice_point: 44574
    slice_point: 44625
    slice_point: 44676
    slice_point: 44727
    slice_point: 44778
    slice_point: 44829
    slice_point: 44880
    slice_point: 44931
    slice_point: 44982
    slice_point: 45033
    slice_point: 45084
    slice_point: 45135
    slice_point: 45186
    slice_point: 45237
    slice_point: 45288
    slice_point: 45339
    slice_point: 45390
    slice_point: 45441
    slice_point: 45492
    slice_point: 45543
    slice_point: 45594
    slice_point: 45645
    slice_point: 45696
    slice_point: 45747
    slice_point: 45798
    slice_point: 45849
    slice_point: 45900
    slice_point: 45951
    slice_point: 46002
    slice_point: 46053
    slice_point: 46104
    slice_point: 46155
    slice_point: 46206
    slice_point: 46257
    slice_point: 46308
    slice_point: 46359
    slice_point: 46410
    slice_point: 46461
    slice_point: 46512
    slice_point: 46563
    slice_point: 46614
    slice_point: 46665
    slice_point: 46716
    slice_point: 46767
    slice_point: 46818
    slice_point: 46869
    slice_point: 46920
    slice_point: 46971
    slice_point: 47022
    slice_point: 47073
    slice_point: 47124
    slice_point: 47175
    slice_point: 47226
    slice_point: 47277
    slice_point: 47328
    slice_point: 47379
    slice_point: 47430
    slice_point: 47481
    slice_point: 47532
    slice_point: 47583
    slice_point: 47634
    slice_point: 47685
    slice_point: 47736
    slice_point: 47787
    slice_point: 47838
    slice_point: 47889
    slice_point: 47940
    slice_point: 47991
    slice_point: 48042
    slice_point: 48093
    slice_point: 48144
    slice_point: 48195
    slice_point: 48246
    slice_point: 48297
    slice_point: 48348
    slice_point: 48399
    slice_point: 48450
    slice_point: 48501
    slice_point: 48552
    slice_point: 48603
    slice_point: 48654
    slice_point: 48705
    slice_point: 48756
    slice_point: 48807
    slice_point: 48858
    slice_point: 48909
    slice_point: 48960
    slice_point: 49011
    slice_point: 49062
    slice_point: 49113
    slice_point: 49164
    slice_point: 49215
    slice_point: 49266
    slice_point: 49317
    slice_point: 49368
    slice_point: 49419
    slice_point: 49470
    slice_point: 49521
    slice_point: 49572
    slice_point: 49623
    slice_point: 49674
    slice_point: 49725
    slice_point: 49776
    slice_point: 49827
    slice_point: 49878
    slice_point: 49929
    slice_point: 49980
    slice_point: 50031
    slice_point: 50082
    slice_point: 50133
    slice_point: 50184
    slice_point: 50235
    slice_point: 50286
    slice_point: 50337
    slice_point: 50388
    slice_point: 50439
    slice_point: 50490
    slice_point: 50541
    slice_point: 50592
    slice_point: 50643
    slice_point: 50694
    slice_point: 50745
    slice_point: 50796
    slice_point: 50847
    slice_point: 50898
    slice_point: 50949

  }
}
layer {
  name: "slice-ip_0-0"
  type: "InnerProduct"
  bottom: "data-0"
  top: "slice-ip_0-0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "slice-ip_1-0"
  type: "InnerProduct"
  bottom: "data-1"
  top: "slice-ip_1-0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "slice-ip_2-0"
  type: "InnerProduct"
  bottom: "data-2"
  top: "slice-ip_2-0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "slice-ip_3-0"
  type: "InnerProduct"
  bottom: "data-3"
  top: "slice-ip_3-0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "slice-ip_4-0"
  type: "InnerProduct"
  bottom: "data-4"
  top: "slice-ip_4-0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "slice-ip_5-0"
  type: "InnerProduct"
  bottom: "data-5"
  top: "slice-ip_5-0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "slice-ip_6-0"
  type: "InnerProduct"
  bottom: "data-6"
  top: "slice-ip_6-0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "slice-ip_7-0"
  type: "InnerProduct"
  bottom: "data-7"
  top: "slice-ip_7-0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "slice-ip_8-0"
  type: "InnerProduct"
  bottom: "data-8"
  top: "slice-ip_8-0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "slice-ip_9-0"
  type: "InnerProduct"
  bottom: "data-9"
  top: "slice-ip_9-0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "slice-ip_10-0"
  type: "InnerProduct"
  bottom: "data-10"
  top: "slice-ip_10-0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "slice-ip_11-0"
  type: "InnerProduct"
  bottom: "data-11"
  top: "slice-ip_11-0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "slice-ip_12-0"
  type: "InnerProduct"
  bottom: "data-12"
  top: "slice-ip_12-0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "slice-ip_13-0"
  type: "InnerProduct"
  bottom: "data-13"
  top: "slice-ip_13-0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "slice-ip_14-0"
  type: "InnerProduct"
  bottom: "data-14"
  top: "slice-ip_14-0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "slice-ip_15-0"
  type: "InnerProduct"
  bottom: "data-15"
  top: "slice-ip_15-0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "slice-ip_16-0"
  type: "InnerProduct"
  bottom: "data-16"
  top: "slice-ip_16-0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "slice-ip_17-0"
  type: "InnerProduct"
  bottom: "data-17"
  top: "slice-ip_17-0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "slice-ip_18-0"
  type: "InnerProduct"
  bottom: "data-18"
  top: "slice-ip_18-0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "slice-ip_19-0"
  type: "InnerProduct"
  bottom: "data-19"
  top: "slice-ip_19-0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 6
    weight_filler {
      type: "xavier"
      std:0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "slice-ip_20-0"
